RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * DMA_CR - Control Register
 ******************************************************************************/

/*!
 * @brief DMA_CR - Control Register (RW)
 *
 * Reset value: 0x00000400U
 *
 * The CR defines the basic operating configuration of the DMA. The DMA
 * arbitrates channel service requests in two groups of 16 channels each: Group 1
 * contains channels 31-16 Group 0 contains channels 15-0 Arbitration within a group can
 * be configured to use either a fixed-priority or a round-robin scheme. For
 * fixed-priority arbitration, the highest priority channel requesting service is
 * selected to execute. The channel priority registers assign the priorities; see
 * the DCHPRIn registers. For round-robin arbitration, the channel priorities are
 * ignored and channels within each group are cycled through (from high to low
 * channel number) without regard to priority. For correct operation, writes to the
 * CR register must be performed only when the DMA channels are inactive; that
 * is, when TCDn_CSR[ACTIVE] bits are cleared. The group priorities operate in a
 * similar fashion. In group fixed priority arbitration mode, channel service
 * requests in the highest priority group are executed first, where priority level 1
 * is the highest and priority level 0 is the lowest. The group priorities are
 * assigned in the GRPnPRI fields of the DMA Control Register (CR). All group
 * priorities must have unique values prior to any channel service requests occurring;
 * otherwise, a configuration error will be reported. For group round robin
 * arbitration, the group priorities are ignored and the groups are cycled through
 * (from high to low group number) without regard to priority. Minor loop offsets
 * are address offset values added to the final source address (TCDn_SADDR) or
 * destination address (TCDn_DADDR) upon minor loop completion. When minor loop
 * offsets are enabled, the minor loop offset (MLOFF) is added to the final source
 * address (TCDn_SADDR), to the final destination address (TCDn_DADDR), or to both
 * prior to the addresses being written back into the TCD. If the major loop is
 * complete, the minor loop offset is ignored and the major loop address offsets
 * (TCDn_SLAST and TCDn_DLAST_SGA) are used to compute the next TCDn_SADDR and
 * TCDn_DADDR values. When minor loop mapping is enabled (EMLM is 1), TCDn word2 is
 * redefined. A portion of TCDn word2 is used to specify multiple fields: a
 * source enable bit (SMLOE) to specify the minor loop offset should be applied to the
 * source address (TCDn_SADDR) upon minor loop completion, a destination enable
 * bit (DMLOE) to specify the minor loop offset should be applied to the
 * destination address (TCDn_DADDR) upon minor loop completion, and the sign extended
 * minor loop offset value (MLOFF). The same offset value (MLOFF) is used for both
 * source and destination minor loop offsets. When either minor loop offset is
 * enabled (SMLOE set or DMLOE set), the NBYTES field is reduced to 10 bits. When
 * both minor loop offsets are disabled (SMLOE cleared and DMLOE cleared), the
 * NBYTES field is a 30-bit vector. When minor loop mapping is disabled (EMLM is 0),
 * all 32 bits of TCDn word2 are assigned to the NBYTES field.
 */
/*!
 * @name Constants and macros for entire DMA_CR register
 */
/*@{*/
#define DMA_RD_CR(base)          (DMA_CR_REG(base))
#define DMA_WR_CR(base, value)   (DMA_CR_REG(base) = (value))
#define DMA_RMW_CR(base, mask, value) (DMA_WR_CR(base, (DMA_RD_CR(base) & ~(mask)) | (value)))
#define DMA_SET_CR(base, value)  (DMA_WR_CR(base, DMA_RD_CR(base) |  (value)))
#define DMA_CLR_CR(base, value)  (DMA_WR_CR(base, DMA_RD_CR(base) & ~(value)))
#define DMA_TOG_CR(base, value)  (DMA_WR_CR(base, DMA_RD_CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_CR bitfields
 */

/*!
 * @name Register DMA_CR, field EDBG[1] (RW)
 *
 * Values:
 * - 0b0 - When in debug mode, the DMA continues to operate.
 * - 0b1 - When in debug mode, the DMA stalls the start of a new channel.
 *     Executing channels are allowed to complete. Channel execution resumes when the
 *     system exits debug mode or the EDBG bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the DMA_CR_EDBG field. */
#define DMA_RD_CR_EDBG(base) ((DMA_CR_REG(base) & DMA_CR_EDBG_MASK) >> DMA_CR_EDBG_SHIFT)
#define DMA_BRD_CR_EDBG(base) (BITBAND_ACCESS32(&DMA_CR_REG(base), DMA_CR_EDBG_SHIFT))

/*! @brief Set the EDBG field to a new value. */
#define DMA_WR_CR_EDBG(base, value) (DMA_RMW_CR(base, DMA_CR_EDBG_MASK, DMA_CR_EDBG(value)))
#define DMA_BWR_CR_EDBG(base, value) (BITBAND_ACCESS32(&DMA_CR_REG(base), DMA_CR_EDBG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_CR, field ERCA[2] (RW)
 *
 * Values:
 * - 0b0 - Fixed priority arbitration is used for channel selection within each
 *     group.
 * - 0b1 - Round robin arbitration is used for channel selection within each
 *     group.
 */
/*@{*/
/*! @brief Read current value of the DMA_CR_ERCA field. */
#define DMA_RD_CR_ERCA(base) ((DMA_CR_REG(base) & DMA_CR_ERCA_MASK) >> DMA_CR_ERCA_SHIFT)
#define DMA_BRD_CR_ERCA(base) (BITBAND_ACCESS32(&DMA_CR_REG(base), DMA_CR_ERCA_SHIFT))

/*! @brief Set the ERCA field to a new value. */
#define DMA_WR_CR_ERCA(base, value) (DMA_RMW_CR(base, DMA_CR_ERCA_MASK, DMA_CR_ERCA(value)))
#define DMA_BWR_CR_ERCA(base, value) (BITBAND_ACCESS32(&DMA_CR_REG(base), DMA_CR_ERCA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_CR, field ERGA[3] (RW)
 *
 * Values:
 * - 0b0 - Fixed priority arbitration is used for selection among the groups.
 * - 0b1 - Round robin arbitration is used for selection among the groups.
 */
/*@{*/
/*! @brief Read current value of the DMA_CR_ERGA field. */
#define DMA_RD_CR_ERGA(base) ((DMA_CR_REG(base) & DMA_CR_ERGA_MASK) >> DMA_CR_ERGA_SHIFT)
#define DMA_BRD_CR_ERGA(base) (BITBAND_ACCESS32(&DMA_CR_REG(base), DMA_CR_ERGA_SHIFT))

/*! @brief Set the ERGA field to a new value. */
#define DMA_WR_CR_ERGA(base, value) (DMA_RMW_CR(base, DMA_CR_ERGA_MASK, DMA_CR_ERGA(value)))
#define DMA_BWR_CR_ERGA(base, value) (BITBAND_ACCESS32(&DMA_CR_REG(base), DMA_CR_ERGA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_CR, field HOE[4] (RW)
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Any error causes the HALT bit to set. Subsequently, all service
 *     requests are ignored until the HALT bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the DMA_CR_HOE field. */
#define DMA_RD_CR_HOE(base)  ((DMA_CR_REG(base) & DMA_CR_HOE_MASK) >> DMA_CR_HOE_SHIFT)
#define DMA_BRD_CR_HOE(base) (BITBAND_ACCESS32(&DMA_CR_REG(base), DMA_CR_HOE_SHIFT))

