RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the EEI25 field to a new value. */
#define DMA_WR_EEI_EEI25(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI25_MASK, DMA_EEI_EEI25(value)))
#define DMA_BWR_EEI_EEI25(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI26[26] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI26 field. */
#define DMA_RD_EEI_EEI26(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI26_MASK) >> DMA_EEI_EEI26_SHIFT)
#define DMA_BRD_EEI_EEI26(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI26_SHIFT))

/*! @brief Set the EEI26 field to a new value. */
#define DMA_WR_EEI_EEI26(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI26_MASK, DMA_EEI_EEI26(value)))
#define DMA_BWR_EEI_EEI26(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI26_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI27[27] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI27 field. */
#define DMA_RD_EEI_EEI27(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI27_MASK) >> DMA_EEI_EEI27_SHIFT)
#define DMA_BRD_EEI_EEI27(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI27_SHIFT))

/*! @brief Set the EEI27 field to a new value. */
#define DMA_WR_EEI_EEI27(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI27_MASK, DMA_EEI_EEI27(value)))
#define DMA_BWR_EEI_EEI27(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI28[28] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI28 field. */
#define DMA_RD_EEI_EEI28(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI28_MASK) >> DMA_EEI_EEI28_SHIFT)
#define DMA_BRD_EEI_EEI28(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI28_SHIFT))

/*! @brief Set the EEI28 field to a new value. */
#define DMA_WR_EEI_EEI28(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI28_MASK, DMA_EEI_EEI28(value)))
#define DMA_BWR_EEI_EEI28(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI29[29] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI29 field. */
#define DMA_RD_EEI_EEI29(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI29_MASK) >> DMA_EEI_EEI29_SHIFT)
#define DMA_BRD_EEI_EEI29(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI29_SHIFT))

/*! @brief Set the EEI29 field to a new value. */
#define DMA_WR_EEI_EEI29(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI29_MASK, DMA_EEI_EEI29(value)))
#define DMA_BWR_EEI_EEI29(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI30[30] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI30 field. */
#define DMA_RD_EEI_EEI30(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI30_MASK) >> DMA_EEI_EEI30_SHIFT)
#define DMA_BRD_EEI_EEI30(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI30_SHIFT))

/*! @brief Set the EEI30 field to a new value. */
#define DMA_WR_EEI_EEI30(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI30_MASK, DMA_EEI_EEI30(value)))
#define DMA_BWR_EEI_EEI30(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI30_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EEI, field EEI31[31] (RW)
 *
 * Values:
 * - 0b0 - The error signal for corresponding channel does not generate an error
 *     interrupt
 * - 0b1 - The assertion of the error signal for corresponding channel generates
 *     an error interrupt request
 */
/*@{*/
/*! @brief Read current value of the DMA_EEI_EEI31 field. */
#define DMA_RD_EEI_EEI31(base) ((DMA_EEI_REG(base) & DMA_EEI_EEI31_MASK) >> DMA_EEI_EEI31_SHIFT)
#define DMA_BRD_EEI_EEI31(base) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI31_SHIFT))

/*! @brief Set the EEI31 field to a new value. */
#define DMA_WR_EEI_EEI31(base, value) (DMA_RMW_EEI(base, DMA_EEI_EEI31_MASK, DMA_EEI_EEI31(value)))
#define DMA_BWR_EEI_EEI31(base, value) (BITBAND_ACCESS32(&DMA_EEI_REG(base), DMA_EEI_EEI31_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_CEEI - Clear Enable Error Interrupt Register
 ******************************************************************************/

/*!
 * @brief DMA_CEEI - Clear Enable Error Interrupt Register (WO)
 *
 * Reset value: 0x00U
 *
 * The CEEI provides a simple memory-mapped mechanism to clear a given bit in
 * the EEI to disable the error interrupt for a given channel. The data value on a
 * register write causes the corresponding bit in the EEI to be cleared. Setting
 * the CAEE bit provides a global clear function, forcing the EEI contents to be
 * cleared, disabling all DMA request inputs. If the NOP bit is set, the command
 * is ignored. This allows you to write multiple-byte registers as a 32-bit word.
 * Reads of this register return all zeroes.
 */
/*!
 * @name Constants and macros for entire DMA_CEEI register
 */
/*@{*/
#define DMA_RD_CEEI(base)        (DMA_CEEI_REG(base))
#define DMA_WR_CEEI(base, value) (DMA_CEEI_REG(base) = (value))
#define DMA_RMW_CEEI(base, mask, value) (DMA_WR_CEEI(base, (DMA_RD_CEEI(base) & ~(mask)) | (value)))
/*@}*/

