RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the ERR15 field to a new value. */
#define DMA_WR_ERR_ERR15(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR15_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR15(value)))
#define DMA_BWR_ERR_ERR15(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR15_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR16[16] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR16 field. */
#define DMA_RD_ERR_ERR16(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR16_MASK) >> DMA_ERR_ERR16_SHIFT)
#define DMA_BRD_ERR_ERR16(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR16_SHIFT))

/*! @brief Set the ERR16 field to a new value. */
#define DMA_WR_ERR_ERR16(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR16_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR16(value)))
#define DMA_BWR_ERR_ERR16(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR16_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR17[17] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR17 field. */
#define DMA_RD_ERR_ERR17(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR17_MASK) >> DMA_ERR_ERR17_SHIFT)
#define DMA_BRD_ERR_ERR17(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR17_SHIFT))

/*! @brief Set the ERR17 field to a new value. */
#define DMA_WR_ERR_ERR17(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR17_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR17(value)))
#define DMA_BWR_ERR_ERR17(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR17_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR18[18] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR18 field. */
#define DMA_RD_ERR_ERR18(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR18_MASK) >> DMA_ERR_ERR18_SHIFT)
#define DMA_BRD_ERR_ERR18(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR18_SHIFT))

/*! @brief Set the ERR18 field to a new value. */
#define DMA_WR_ERR_ERR18(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR18_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR18(value)))
#define DMA_BWR_ERR_ERR18(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR19[19] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR19 field. */
#define DMA_RD_ERR_ERR19(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR19_MASK) >> DMA_ERR_ERR19_SHIFT)
#define DMA_BRD_ERR_ERR19(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR19_SHIFT))

/*! @brief Set the ERR19 field to a new value. */
#define DMA_WR_ERR_ERR19(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR19_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR19(value)))
#define DMA_BWR_ERR_ERR19(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR19_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR20[20] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR20 field. */
#define DMA_RD_ERR_ERR20(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR20_MASK) >> DMA_ERR_ERR20_SHIFT)
#define DMA_BRD_ERR_ERR20(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR20_SHIFT))

/*! @brief Set the ERR20 field to a new value. */
#define DMA_WR_ERR_ERR20(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR20_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR20(value)))
#define DMA_BWR_ERR_ERR20(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR20_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR21[21] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR21 field. */
#define DMA_RD_ERR_ERR21(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR21_MASK) >> DMA_ERR_ERR21_SHIFT)
#define DMA_BRD_ERR_ERR21(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR21_SHIFT))

/*! @brief Set the ERR21 field to a new value. */
#define DMA_WR_ERR_ERR21(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR21_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR21(value)))
#define DMA_BWR_ERR_ERR21(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR22[22] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR22 field. */
#define DMA_RD_ERR_ERR22(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR22_MASK) >> DMA_ERR_ERR22_SHIFT)
#define DMA_BRD_ERR_ERR22(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR22_SHIFT))

/*! @brief Set the ERR22 field to a new value. */
#define DMA_WR_ERR_ERR22(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR22_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR22(value)))
#define DMA_BWR_ERR_ERR22(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR23[23] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR23 field. */
#define DMA_RD_ERR_ERR23(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR23_MASK) >> DMA_ERR_ERR23_SHIFT)
#define DMA_BRD_ERR_ERR23(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR23_SHIFT))

/*! @brief Set the ERR23 field to a new value. */
#define DMA_WR_ERR_ERR23(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR23_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK | DMA_ERR_ERR31_MASK), DMA_ERR_ERR23(value)))
#define DMA_BWR_ERR_ERR23(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_ERR, field ERR24[24] (W1C)
 *
 * Values:
 * - 0b0 - An error in this channel has not occurred
 * - 0b1 - An error in this channel has occurred
 */
/*@{*/
/*! @brief Read current value of the DMA_ERR_ERR24 field. */
#define DMA_RD_ERR_ERR24(base) ((DMA_ERR_REG(base) & DMA_ERR_ERR24_MASK) >> DMA_ERR_ERR24_SHIFT)
#define DMA_BRD_ERR_ERR24(base) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR24_SHIFT))

