RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the EDREQ_24 field to a new value. */
#define DMA_WR_EARS_EDREQ_24(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_24_MASK, DMA_EARS_EDREQ_24(value)))
#define DMA_BWR_EARS_EDREQ_24(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_25[25] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 25
 * - 0b1 - Enable asynchronous DMA request for channel 25
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_25 field. */
#define DMA_RD_EARS_EDREQ_25(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_25_MASK) >> DMA_EARS_EDREQ_25_SHIFT)
#define DMA_BRD_EARS_EDREQ_25(base) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_25_SHIFT))

/*! @brief Set the EDREQ_25 field to a new value. */
#define DMA_WR_EARS_EDREQ_25(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_25_MASK, DMA_EARS_EDREQ_25(value)))
#define DMA_BWR_EARS_EDREQ_25(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_26[26] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 26
 * - 0b1 - Enable asynchronous DMA request for channel 26
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_26 field. */
#define DMA_RD_EARS_EDREQ_26(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_26_MASK) >> DMA_EARS_EDREQ_26_SHIFT)
#define DMA_BRD_EARS_EDREQ_26(base) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_26_SHIFT))

/*! @brief Set the EDREQ_26 field to a new value. */
#define DMA_WR_EARS_EDREQ_26(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_26_MASK, DMA_EARS_EDREQ_26(value)))
#define DMA_BWR_EARS_EDREQ_26(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_26_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_27[27] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 27
 * - 0b1 - Enable asynchronous DMA request for channel 27
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_27 field. */
#define DMA_RD_EARS_EDREQ_27(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_27_MASK) >> DMA_EARS_EDREQ_27_SHIFT)
#define DMA_BRD_EARS_EDREQ_27(base) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_27_SHIFT))

/*! @brief Set the EDREQ_27 field to a new value. */
#define DMA_WR_EARS_EDREQ_27(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_27_MASK, DMA_EARS_EDREQ_27(value)))
#define DMA_BWR_EARS_EDREQ_27(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_28[28] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 28
 * - 0b1 - Enable asynchronous DMA request for channel 28
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_28 field. */
#define DMA_RD_EARS_EDREQ_28(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_28_MASK) >> DMA_EARS_EDREQ_28_SHIFT)
#define DMA_BRD_EARS_EDREQ_28(base) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_28_SHIFT))

/*! @brief Set the EDREQ_28 field to a new value. */
#define DMA_WR_EARS_EDREQ_28(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_28_MASK, DMA_EARS_EDREQ_28(value)))
#define DMA_BWR_EARS_EDREQ_28(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_29[29] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 29
 * - 0b1 - Enable asynchronous DMA request for channel 29
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_29 field. */
#define DMA_RD_EARS_EDREQ_29(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_29_MASK) >> DMA_EARS_EDREQ_29_SHIFT)
#define DMA_BRD_EARS_EDREQ_29(base) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_29_SHIFT))

/*! @brief Set the EDREQ_29 field to a new value. */
#define DMA_WR_EARS_EDREQ_29(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_29_MASK, DMA_EARS_EDREQ_29(value)))
#define DMA_BWR_EARS_EDREQ_29(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_30[30] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 30
 * - 0b1 - Enable asynchronous DMA request for channel 30
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_30 field. */
#define DMA_RD_EARS_EDREQ_30(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_30_MASK) >> DMA_EARS_EDREQ_30_SHIFT)
#define DMA_BRD_EARS_EDREQ_30(base) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_30_SHIFT))

/*! @brief Set the EDREQ_30 field to a new value. */
#define DMA_WR_EARS_EDREQ_30(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_30_MASK, DMA_EARS_EDREQ_30(value)))
#define DMA_BWR_EARS_EDREQ_30(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_30_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_31[31] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 31
 * - 0b1 - Enable asynchronous DMA request for channel 31
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_31 field. */
#define DMA_RD_EARS_EDREQ_31(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_31_MASK) >> DMA_EARS_EDREQ_31_SHIFT)
#define DMA_BRD_EARS_EDREQ_31(base) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_31_SHIFT))

/*! @brief Set the EDREQ_31 field to a new value. */
#define DMA_WR_EARS_EDREQ_31(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_31_MASK, DMA_EARS_EDREQ_31(value)))
#define DMA_BWR_EARS_EDREQ_31(base, value) (BITBAND_ACCESS32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_31_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI3 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI3 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values; otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI3 register
 */
/*@{*/
#define DMA_RD_DCHPRI3(base)     (DMA_DCHPRI3_REG(base))
#define DMA_WR_DCHPRI3(base, value) (DMA_DCHPRI3_REG(base) = (value))
#define DMA_RMW_DCHPRI3(base, mask, value) (DMA_WR_DCHPRI3(base, (DMA_RD_DCHPRI3(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) |  (value)))
#define DMA_CLR_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) & ~(value)))
#define DMA_TOG_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) ^  (value)))
/*@}*/

