RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI24 bitfields
 */

/*!
 * @name Register DMA_DCHPRI24, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] = 0b01111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI24_CHPRI field. */
#define DMA_RD_DCHPRI24_CHPRI(base) ((DMA_DCHPRI24_REG(base) & DMA_DCHPRI24_CHPRI_MASK) >> DMA_DCHPRI24_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI24_CHPRI(base) (DMA_RD_DCHPRI24_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI24_CHPRI(base, value) (DMA_RMW_DCHPRI24(base, DMA_DCHPRI24_CHPRI_MASK, DMA_DCHPRI24_CHPRI(value)))
#define DMA_BWR_DCHPRI24_CHPRI(base, value) (DMA_WR_DCHPRI24_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI24, field GRPPRI[5:4] (RO)
 *
 * Group priority assigned to this channel group when fixed-priority arbitration
 * is enabled. This field is read-only; writes are ignored. Reset value for the
 * group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] equals 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI24_GRPPRI field. */
#define DMA_RD_DCHPRI24_GRPPRI(base) ((DMA_DCHPRI24_REG(base) & DMA_DCHPRI24_GRPPRI_MASK) >> DMA_DCHPRI24_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI24_GRPPRI(base) (DMA_RD_DCHPRI24_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI24, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI24_DPA field. */
#define DMA_RD_DCHPRI24_DPA(base) ((DMA_DCHPRI24_REG(base) & DMA_DCHPRI24_DPA_MASK) >> DMA_DCHPRI24_DPA_SHIFT)
#define DMA_BRD_DCHPRI24_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI24_REG(base), DMA_DCHPRI24_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI24_DPA(base, value) (DMA_RMW_DCHPRI24(base, DMA_DCHPRI24_DPA_MASK, DMA_DCHPRI24_DPA(value)))
#define DMA_BWR_DCHPRI24_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI24_REG(base), DMA_DCHPRI24_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI24, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI24_ECP field. */
#define DMA_RD_DCHPRI24_ECP(base) ((DMA_DCHPRI24_REG(base) & DMA_DCHPRI24_ECP_MASK) >> DMA_DCHPRI24_ECP_SHIFT)
#define DMA_BRD_DCHPRI24_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI24_REG(base), DMA_DCHPRI24_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI24_ECP(base, value) (DMA_RMW_DCHPRI24(base, DMA_DCHPRI24_ECP_MASK, DMA_DCHPRI24_ECP(value)))
#define DMA_BWR_DCHPRI24_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI24_REG(base), DMA_DCHPRI24_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI31 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI31 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values; otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI31 register
 */
/*@{*/
#define DMA_RD_DCHPRI31(base)    (DMA_DCHPRI31_REG(base))
#define DMA_WR_DCHPRI31(base, value) (DMA_DCHPRI31_REG(base) = (value))
#define DMA_RMW_DCHPRI31(base, mask, value) (DMA_WR_DCHPRI31(base, (DMA_RD_DCHPRI31(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI31(base, value) (DMA_WR_DCHPRI31(base, DMA_RD_DCHPRI31(base) |  (value)))
#define DMA_CLR_DCHPRI31(base, value) (DMA_WR_DCHPRI31(base, DMA_RD_DCHPRI31(base) & ~(value)))
#define DMA_TOG_DCHPRI31(base, value) (DMA_WR_DCHPRI31(base, DMA_RD_DCHPRI31(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI31 bitfields
 */

/*!
 * @name Register DMA_DCHPRI31, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] = 0b01111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI31_CHPRI field. */
#define DMA_RD_DCHPRI31_CHPRI(base) ((DMA_DCHPRI31_REG(base) & DMA_DCHPRI31_CHPRI_MASK) >> DMA_DCHPRI31_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI31_CHPRI(base) (DMA_RD_DCHPRI31_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI31_CHPRI(base, value) (DMA_RMW_DCHPRI31(base, DMA_DCHPRI31_CHPRI_MASK, DMA_DCHPRI31_CHPRI(value)))
#define DMA_BWR_DCHPRI31_CHPRI(base, value) (DMA_WR_DCHPRI31_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI31, field GRPPRI[5:4] (RO)
 *
 * Group priority assigned to this channel group when fixed-priority arbitration
 * is enabled. This field is read-only; writes are ignored. Reset value for the
 * group and channel priority fields, GRPPRI and CHPRI, is equal to the
 * corresponding channel number for each priority register, that is, DCHPRI31[GRPPRI] =
 * 0b01 and DCHPRI31[CHPRI] equals 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI31_GRPPRI field. */
#define DMA_RD_DCHPRI31_GRPPRI(base) ((DMA_DCHPRI31_REG(base) & DMA_DCHPRI31_GRPPRI_MASK) >> DMA_DCHPRI31_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI31_GRPPRI(base) (DMA_RD_DCHPRI31_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI31, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI31_DPA field. */
#define DMA_RD_DCHPRI31_DPA(base) ((DMA_DCHPRI31_REG(base) & DMA_DCHPRI31_DPA_MASK) >> DMA_DCHPRI31_DPA_SHIFT)
#define DMA_BRD_DCHPRI31_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI31_REG(base), DMA_DCHPRI31_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI31_DPA(base, value) (DMA_RMW_DCHPRI31(base, DMA_DCHPRI31_DPA_MASK, DMA_DCHPRI31_DPA(value)))
#define DMA_BWR_DCHPRI31_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI31_REG(base), DMA_DCHPRI31_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI31, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI31_ECP field. */
#define DMA_RD_DCHPRI31_ECP(base) ((DMA_DCHPRI31_REG(base) & DMA_DCHPRI31_ECP_MASK) >> DMA_DCHPRI31_ECP_SHIFT)
#define DMA_BRD_DCHPRI31_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI31_REG(base), DMA_DCHPRI31_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI31_ECP(base, value) (DMA_RMW_DCHPRI31(base, DMA_DCHPRI31_ECP_MASK, DMA_DCHPRI31_ECP(value)))
#define DMA_BWR_DCHPRI31_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI31_REG(base), DMA_DCHPRI31_ECP_SHIFT) = (value))
/*@}*/

