RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * FMC_PFB01CR - Flash Bank 0-1 Control Register
 ******************************************************************************/

/*!
 * @brief FMC_PFB01CR - Flash Bank 0-1 Control Register (RW)
 *
 * Reset value: 0x3004001FU
 *
 * In FlexMemory mode, where flash memory banks 0, 1, and 2 are used for program
 * flash and flash memory bank 3 is used for FlexNVM, the FMC_PFB01CR register
 * controls the operation of flash memory banks 0, 1, and 2 (all program flash).
 * In Program Flash Only mode, where flash memory banks 0, 1, 2, and 3 are used
 * for program flash, the FMC_PFB01CR register controls the operation of flash
 * memory banks 0 and 1.
 */
/*!
 * @name Constants and macros for entire FMC_PFB01CR register
 */
/*@{*/
#define FMC_RD_PFB01CR(base)     (FMC_PFB01CR_REG(base))
#define FMC_WR_PFB01CR(base, value) (FMC_PFB01CR_REG(base) = (value))
#define FMC_RMW_PFB01CR(base, mask, value) (FMC_WR_PFB01CR(base, (FMC_RD_PFB01CR(base) & ~(mask)) | (value)))
#define FMC_SET_PFB01CR(base, value) (FMC_WR_PFB01CR(base, FMC_RD_PFB01CR(base) |  (value)))
#define FMC_CLR_PFB01CR(base, value) (FMC_WR_PFB01CR(base, FMC_RD_PFB01CR(base) & ~(value)))
#define FMC_TOG_PFB01CR(base, value) (FMC_WR_PFB01CR(base, FMC_RD_PFB01CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FMC_PFB01CR bitfields
 */

/*!
 * @name Register FMC_PFB01CR, field RFU[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_RFU field. */
#define FMC_RD_PFB01CR_RFU(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_RFU_MASK) >> FMC_PFB01CR_RFU_SHIFT)
#define FMC_BRD_PFB01CR_RFU(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_RFU_SHIFT))

/*! @brief Set the RFU field to a new value. */
#define FMC_WR_PFB01CR_RFU(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_RFU_MASK, FMC_PFB01CR_RFU(value)))
#define FMC_BWR_PFB01CR_RFU(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_RFU_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B0IPE[1] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to instruction fetches.
 *
 * Values:
 * - 0b0 - Do not prefetch in response to instruction fetches.
 * - 0b1 - Enable prefetches in response to instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B0IPE field. */
#define FMC_RD_PFB01CR_B0IPE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B0IPE_MASK) >> FMC_PFB01CR_B0IPE_SHIFT)
#define FMC_BRD_PFB01CR_B0IPE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0IPE_SHIFT))

/*! @brief Set the B0IPE field to a new value. */
#define FMC_WR_PFB01CR_B0IPE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B0IPE_MASK, FMC_PFB01CR_B0IPE(value)))
#define FMC_BWR_PFB01CR_B0IPE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0IPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B0DPE[2] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to data references.
 *
 * Values:
 * - 0b0 - Do not prefetch in response to data references.
 * - 0b1 - Enable prefetches in response to data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B0DPE field. */
#define FMC_RD_PFB01CR_B0DPE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B0DPE_MASK) >> FMC_PFB01CR_B0DPE_SHIFT)
#define FMC_BRD_PFB01CR_B0DPE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0DPE_SHIFT))

/*! @brief Set the B0DPE field to a new value. */
#define FMC_WR_PFB01CR_B0DPE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B0DPE_MASK, FMC_PFB01CR_B0DPE(value)))
#define FMC_BWR_PFB01CR_B0DPE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0DPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B0ICE[3] (RW)
 *
 * This bit controls whether instruction fetches are loaded into the cache.
 *
 * Values:
 * - 0b0 - Do not cache instruction fetches.
 * - 0b1 - Cache instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B0ICE field. */
#define FMC_RD_PFB01CR_B0ICE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B0ICE_MASK) >> FMC_PFB01CR_B0ICE_SHIFT)
#define FMC_BRD_PFB01CR_B0ICE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0ICE_SHIFT))

/*! @brief Set the B0ICE field to a new value. */
#define FMC_WR_PFB01CR_B0ICE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B0ICE_MASK, FMC_PFB01CR_B0ICE(value)))
#define FMC_BWR_PFB01CR_B0ICE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0ICE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B0DCE[4] (RW)
 *
 * This bit controls whether data references are loaded into the cache.
 *
 * Values:
 * - 0b0 - Do not cache data references.
 * - 0b1 - Cache data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B0DCE field. */
#define FMC_RD_PFB01CR_B0DCE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B0DCE_MASK) >> FMC_PFB01CR_B0DCE_SHIFT)
#define FMC_BRD_PFB01CR_B0DCE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0DCE_SHIFT))

/*! @brief Set the B0DCE field to a new value. */
#define FMC_WR_PFB01CR_B0DCE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B0DCE_MASK, FMC_PFB01CR_B0DCE(value)))
#define FMC_BWR_PFB01CR_B0DCE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B0DCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field CRC[7:5] (RW)
 *
 * This 3-bit field defines the replacement algorithm for accesses that are
 * cached.
 *
 * Values:
 * - 0b000 - LRU replacement algorithm per set across all four ways
 * - 0b001 - Reserved
 * - 0b010 - Independent LRU with ways [0-1] for ifetches, [2-3] for data
 * - 0b011 - Independent LRU with ways [0-2] for ifetches, [3] for data
 * - 0b1xx - Reserved
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_CRC field. */
#define FMC_RD_PFB01CR_CRC(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_CRC_MASK) >> FMC_PFB01CR_CRC_SHIFT)
#define FMC_BRD_PFB01CR_CRC(base) (FMC_RD_PFB01CR_CRC(base))

/*! @brief Set the CRC field to a new value. */
#define FMC_WR_PFB01CR_CRC(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_CRC_MASK, FMC_PFB01CR_CRC(value)))
#define FMC_BWR_PFB01CR_CRC(base, value) (FMC_WR_PFB01CR_CRC(base, value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B0MW[18:17] (RO)
 *
 * This read-only field defines the width of bank 0 memory.
 *
 * Values:
 * - 0b00 - 32 bits
 * - 0b01 - 64 bits
 * - 0b10 - 128 bits
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B0MW field. */
#define FMC_RD_PFB01CR_B0MW(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B0MW_MASK) >> FMC_PFB01CR_B0MW_SHIFT)
#define FMC_BRD_PFB01CR_B0MW(base) (FMC_RD_PFB01CR_B0MW(base))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field S_B_INV[19] (WORZ)
 *
 * This bit determines if the FMC's prefetch speculation buffer is to be
 * invalidated (cleared). When this bit is written, the speculation buffer is
 * immediately cleared. This bit always reads as zero.
 *
 * Values:
 * - 0b0 - Speculation buffer is not affected
 * - 0b1 - Invalidate (clear) speculation buffer
 */
/*@{*/
/*! @brief Set the S_B_INV field to a new value. */
#define FMC_WR_PFB01CR_S_B_INV(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_S_B_INV_MASK, FMC_PFB01CR_S_B_INV(value)))
#define FMC_BWR_PFB01CR_S_B_INV(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_S_B_INV_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field CINV_WAY[23:20] (WORZ)
 *
 * These bits determine if the given cache way is to be invalidated (cleared).
 * When a bit within this field is written, the corresponding cache way is
 * immediately invalidated: the way's tag, data, and valid contents are cleared. This
 * field always reads as zero. Cache invalidation takes precedence over locking.
 * The cache is invalidated by system reset. System software is required to
 * maintain memory coherency when any segment of the flash memory is programmed or
 * erased. Accordingly, cache invalidations must occur after a programming or erase
 * event is completed and before the new memory image is accessed. The bit setting
 * definitions are for each bit in the field.
 *
 * Values:
 * - 0b0000 - No cache way invalidation for the corresponding cache
 * - 0b0001 - Invalidate cache way for the corresponding cache: clear the tag,
 *     data, and vld bits of ways selected
 */
/*@{*/
/*! @brief Set the CINV_WAY field to a new value. */
#define FMC_WR_PFB01CR_CINV_WAY(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_CINV_WAY_MASK, FMC_PFB01CR_CINV_WAY(value)))
#define FMC_BWR_PFB01CR_CINV_WAY(base, value) (FMC_WR_PFB01CR_CINV_WAY(base, value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field CLCK_WAY[27:24] (RW)
 *
 * These bits determine if the given cache way is locked such that its contents
 * will not be displaced by future misses. The bit setting definitions are for
 * each bit in the field.
 *
 * Values:
 * - 0b0000 - Cache way is unlocked and may be displaced
 * - 0b0001 - Cache way is locked and its contents are not displaced
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_CLCK_WAY field. */
#define FMC_RD_PFB01CR_CLCK_WAY(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_CLCK_WAY_MASK) >> FMC_PFB01CR_CLCK_WAY_SHIFT)
#define FMC_BRD_PFB01CR_CLCK_WAY(base) (FMC_RD_PFB01CR_CLCK_WAY(base))

/*! @brief Set the CLCK_WAY field to a new value. */
#define FMC_WR_PFB01CR_CLCK_WAY(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_CLCK_WAY_MASK, FMC_PFB01CR_CLCK_WAY(value)))
#define FMC_BWR_PFB01CR_CLCK_WAY(base, value) (FMC_WR_PFB01CR_CLCK_WAY(base, value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B0RWSC[31:28] (RO)
 *
 * This read-only field defines the number of wait states required to access
 * bank 0 flash memory. The relationship between the read access time of the flash
 * array (expressed in system clock cycles) and RWSC is defined as: Access time of
 * flash array [system clocks] = RWSC + 1 The FMC automatically calculates this
 * value based on the ratio of the system clock speed to the flash clock speed.
 * For example, when this ratio is 4:1, the field's value is 3h.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B0RWSC field. */
#define FMC_RD_PFB01CR_B0RWSC(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B0RWSC_MASK) >> FMC_PFB01CR_B0RWSC_SHIFT)
#define FMC_BRD_PFB01CR_B0RWSC(base) (FMC_RD_PFB01CR_B0RWSC(base))
/*@}*/

