RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * FTFE_FCCOB8 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB8 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB8 register
 */
/*@{*/
#define FTFE_RD_FCCOB8(base)     (FTFE_FCCOB8_REG(base))
#define FTFE_WR_FCCOB8(base, value) (FTFE_FCCOB8_REG(base) = (value))
#define FTFE_RMW_FCCOB8(base, mask, value) (FTFE_WR_FCCOB8(base, (FTFE_RD_FCCOB8(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB8(base, value) (FTFE_WR_FCCOB8(base, FTFE_RD_FCCOB8(base) |  (value)))
#define FTFE_CLR_FCCOB8(base, value) (FTFE_WR_FCCOB8(base, FTFE_RD_FCCOB8(base) & ~(value)))
#define FTFE_TOG_FCCOB8(base, value) (FTFE_WR_FCCOB8(base, FTFE_RD_FCCOB8(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FPROT3 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT3 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT3 register
 */
/*@{*/
#define FTFE_RD_FPROT3(base)     (FTFE_FPROT3_REG(base))
#define FTFE_WR_FPROT3(base, value) (FTFE_FPROT3_REG(base) = (value))
#define FTFE_RMW_FPROT3(base, mask, value) (FTFE_WR_FPROT3(base, (FTFE_RD_FPROT3(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT3(base, value) (FTFE_WR_FPROT3(base, FTFE_RD_FPROT3(base) |  (value)))
#define FTFE_CLR_FPROT3(base, value) (FTFE_WR_FPROT3(base, FTFE_RD_FPROT3(base) & ~(value)))
#define FTFE_TOG_FPROT3(base, value) (FTFE_WR_FPROT3(base, FTFE_RD_FPROT3(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FPROT2 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT2 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT2 register
 */
/*@{*/
#define FTFE_RD_FPROT2(base)     (FTFE_FPROT2_REG(base))
#define FTFE_WR_FPROT2(base, value) (FTFE_FPROT2_REG(base) = (value))
#define FTFE_RMW_FPROT2(base, mask, value) (FTFE_WR_FPROT2(base, (FTFE_RD_FPROT2(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT2(base, value) (FTFE_WR_FPROT2(base, FTFE_RD_FPROT2(base) |  (value)))
#define FTFE_CLR_FPROT2(base, value) (FTFE_WR_FPROT2(base, FTFE_RD_FPROT2(base) & ~(value)))
#define FTFE_TOG_FPROT2(base, value) (FTFE_WR_FPROT2(base, FTFE_RD_FPROT2(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FPROT1 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT1 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT1 register
 */
/*@{*/
#define FTFE_RD_FPROT1(base)     (FTFE_FPROT1_REG(base))
#define FTFE_WR_FPROT1(base, value) (FTFE_FPROT1_REG(base) = (value))
#define FTFE_RMW_FPROT1(base, mask, value) (FTFE_WR_FPROT1(base, (FTFE_RD_FPROT1(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT1(base, value) (FTFE_WR_FPROT1(base, FTFE_RD_FPROT1(base) |  (value)))
#define FTFE_CLR_FPROT1(base, value) (FTFE_WR_FPROT1(base, FTFE_RD_FPROT1(base) & ~(value)))
#define FTFE_TOG_FPROT1(base, value) (FTFE_WR_FPROT1(base, FTFE_RD_FPROT1(base) ^  (value)))
/*@}*/

