RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the LRW field to a new value. */
#define RTC_WR_WAR_LRW(base, value) (RTC_RMW_WAR(base, RTC_WAR_LRW_MASK, RTC_WAR_LRW(value)))
#define RTC_BWR_WAR_LRW(base, value) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_LRW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_WAR, field IERW[7] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Writes to the Interupt Enable Register are ignored.
 * - 0b1 - Writes to the Interrupt Enable Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_WAR_IERW field. */
#define RTC_RD_WAR_IERW(base) ((RTC_WAR_REG(base) & RTC_WAR_IERW_MASK) >> RTC_WAR_IERW_SHIFT)
#define RTC_BRD_WAR_IERW(base) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_IERW_SHIFT))

/*! @brief Set the IERW field to a new value. */
#define RTC_WR_WAR_IERW(base, value) (RTC_RMW_WAR(base, RTC_WAR_IERW_MASK, RTC_WAR_IERW(value)))
#define RTC_BWR_WAR_IERW(base, value) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_IERW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_WAR, field TTSW[8] (RW)
 *
 * After being cleared, this bit is set onlyby system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Writes to the Tamper Time Seconds Register are ignored.
 * - 0b1 - Writes to the Tamper Time Seconds Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_WAR_TTSW field. */
#define RTC_RD_WAR_TTSW(base) ((RTC_WAR_REG(base) & RTC_WAR_TTSW_MASK) >> RTC_WAR_TTSW_SHIFT)
#define RTC_BRD_WAR_TTSW(base) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_TTSW_SHIFT))

/*! @brief Set the TTSW field to a new value. */
#define RTC_WR_WAR_TTSW(base, value) (RTC_RMW_WAR(base, RTC_WAR_TTSW_MASK, RTC_WAR_TTSW(value)))
#define RTC_BWR_WAR_TTSW(base, value) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_TTSW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_WAR, field MERW[9] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Writes to the Monotonic Enable Register are ignored.
 * - 0b1 - Writes to the Monotonic Enable Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_WAR_MERW field. */
#define RTC_RD_WAR_MERW(base) ((RTC_WAR_REG(base) & RTC_WAR_MERW_MASK) >> RTC_WAR_MERW_SHIFT)
#define RTC_BRD_WAR_MERW(base) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_MERW_SHIFT))

/*! @brief Set the MERW field to a new value. */
#define RTC_WR_WAR_MERW(base, value) (RTC_RMW_WAR(base, RTC_WAR_MERW_MASK, RTC_WAR_MERW(value)))
#define RTC_BWR_WAR_MERW(base, value) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_MERW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_WAR, field MCLW[10] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Writes to the Monotonic Counter Low Register are ignored.
 * - 0b1 - Writes to the Monotonic Counter Low Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_WAR_MCLW field. */
#define RTC_RD_WAR_MCLW(base) ((RTC_WAR_REG(base) & RTC_WAR_MCLW_MASK) >> RTC_WAR_MCLW_SHIFT)
#define RTC_BRD_WAR_MCLW(base) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_MCLW_SHIFT))

/*! @brief Set the MCLW field to a new value. */
#define RTC_WR_WAR_MCLW(base, value) (RTC_RMW_WAR(base, RTC_WAR_MCLW_MASK, RTC_WAR_MCLW(value)))
#define RTC_BWR_WAR_MCLW(base, value) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_MCLW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_WAR, field MCHW[11] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Writes to the Monotonic Counter High Register are ignored.
 * - 0b1 - Writes to the Monotonic Counter High Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_WAR_MCHW field. */
#define RTC_RD_WAR_MCHW(base) ((RTC_WAR_REG(base) & RTC_WAR_MCHW_MASK) >> RTC_WAR_MCHW_SHIFT)
#define RTC_BRD_WAR_MCHW(base) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_MCHW_SHIFT))

/*! @brief Set the MCHW field to a new value. */
#define RTC_WR_WAR_MCHW(base, value) (RTC_RMW_WAR(base, RTC_WAR_MCHW_MASK, RTC_WAR_MCHW(value)))
#define RTC_BWR_WAR_MCHW(base, value) (BITBAND_ACCESS32(&RTC_WAR_REG(base), RTC_WAR_MCHW_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * RTC_RAR - RTC Read Access Register
 ******************************************************************************/

/*!
 * @brief RTC_RAR - RTC Read Access Register (RW)
 *
 * Reset value: 0x0000FFFFU
 */
/*!
 * @name Constants and macros for entire RTC_RAR register
 */
/*@{*/
#define RTC_RD_RAR(base)         (RTC_RAR_REG(base))
#define RTC_WR_RAR(base, value)  (RTC_RAR_REG(base) = (value))
#define RTC_RMW_RAR(base, mask, value) (RTC_WR_RAR(base, (RTC_RD_RAR(base) & ~(mask)) | (value)))
#define RTC_SET_RAR(base, value) (RTC_WR_RAR(base, RTC_RD_RAR(base) |  (value)))
#define RTC_CLR_RAR(base, value) (RTC_WR_RAR(base, RTC_RD_RAR(base) & ~(value)))
#define RTC_TOG_RAR(base, value) (RTC_WR_RAR(base, RTC_RD_RAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual RTC_RAR bitfields
 */

/*!
 * @name Register RTC_RAR, field TSRR[0] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Seconds Register are ignored.
 * - 0b1 - Reads to the Time Seconds Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TSRR field. */
#define RTC_RD_RAR_TSRR(base) ((RTC_RAR_REG(base) & RTC_RAR_TSRR_MASK) >> RTC_RAR_TSRR_SHIFT)
#define RTC_BRD_RAR_TSRR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TSRR_SHIFT))

/*! @brief Set the TSRR field to a new value. */
#define RTC_WR_RAR_TSRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TSRR_MASK, RTC_RAR_TSRR(value)))
#define RTC_BWR_RAR_TSRR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TSRR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field TPRR[1] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Pprescaler Register are ignored.
 * - 0b1 - Reads to the Time Prescaler Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TPRR field. */
#define RTC_RD_RAR_TPRR(base) ((RTC_RAR_REG(base) & RTC_RAR_TPRR_MASK) >> RTC_RAR_TPRR_SHIFT)
#define RTC_BRD_RAR_TPRR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TPRR_SHIFT))

/*! @brief Set the TPRR field to a new value. */
#define RTC_WR_RAR_TPRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TPRR_MASK, RTC_RAR_TPRR(value)))
#define RTC_BWR_RAR_TPRR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TPRR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field TARR[2] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Alarm Register are ignored.
 * - 0b1 - Reads to the Time Alarm Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TARR field. */
#define RTC_RD_RAR_TARR(base) ((RTC_RAR_REG(base) & RTC_RAR_TARR_MASK) >> RTC_RAR_TARR_SHIFT)
#define RTC_BRD_RAR_TARR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TARR_SHIFT))

/*! @brief Set the TARR field to a new value. */
#define RTC_WR_RAR_TARR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TARR_MASK, RTC_RAR_TARR(value)))
#define RTC_BWR_RAR_TARR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TARR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field TCRR[3] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Reads to the Time Compensation Register are ignored.
 * - 0b1 - Reads to the Time Compensation Register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TCRR field. */
#define RTC_RD_RAR_TCRR(base) ((RTC_RAR_REG(base) & RTC_RAR_TCRR_MASK) >> RTC_RAR_TCRR_SHIFT)
#define RTC_BRD_RAR_TCRR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TCRR_SHIFT))

