RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * SIM_SOPT9 - System Options Register 9
 ******************************************************************************/

/*!
 * @brief SIM_SOPT9 - System Options Register 9 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT9 register
 */
/*@{*/
#define SIM_RD_SOPT9(base)       (SIM_SOPT9_REG(base))
#define SIM_WR_SOPT9(base, value) (SIM_SOPT9_REG(base) = (value))
#define SIM_RMW_SOPT9(base, mask, value) (SIM_WR_SOPT9(base, (SIM_RD_SOPT9(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT9(base, value) (SIM_WR_SOPT9(base, SIM_RD_SOPT9(base) |  (value)))
#define SIM_CLR_SOPT9(base, value) (SIM_WR_SOPT9(base, SIM_RD_SOPT9(base) & ~(value)))
#define SIM_TOG_SOPT9(base, value) (SIM_WR_SOPT9(base, SIM_RD_SOPT9(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT9 bitfields
 */

/*!
 * @name Register SIM_SOPT9, field TPM1CH0SRC[19:18] (RW)
 *
 * Selects the source for TPM1 channel 0 input capture. When the TPM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 0b00 - TPM1_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_TPM1CH0SRC field. */
#define SIM_RD_SOPT9_TPM1CH0SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_TPM1CH0SRC_MASK) >> SIM_SOPT9_TPM1CH0SRC_SHIFT)
#define SIM_BRD_SOPT9_TPM1CH0SRC(base) (SIM_RD_SOPT9_TPM1CH0SRC(base))

/*! @brief Set the TPM1CH0SRC field to a new value. */
#define SIM_WR_SOPT9_TPM1CH0SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_TPM1CH0SRC_MASK, SIM_SOPT9_TPM1CH0SRC(value)))
#define SIM_BWR_SOPT9_TPM1CH0SRC(base, value) (SIM_WR_SOPT9_TPM1CH0SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field TPM2CH0SRC[21:20] (RW)
 *
 * Selects the source for TPM2 channel 0 input capture. When the TPM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 0b00 - TPM2_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_TPM2CH0SRC field. */
#define SIM_RD_SOPT9_TPM2CH0SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_TPM2CH0SRC_MASK) >> SIM_SOPT9_TPM2CH0SRC_SHIFT)
#define SIM_BRD_SOPT9_TPM2CH0SRC(base) (SIM_RD_SOPT9_TPM2CH0SRC(base))

/*! @brief Set the TPM2CH0SRC field to a new value. */
#define SIM_WR_SOPT9_TPM2CH0SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_TPM2CH0SRC_MASK, SIM_SOPT9_TPM2CH0SRC(value)))
#define SIM_BWR_SOPT9_TPM2CH0SRC(base, value) (SIM_WR_SOPT9_TPM2CH0SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field TPM1CLKSEL[25] (RW)
 *
 * Selects the external pin used to drive the clock to the TPM1 module. The
 * selected pin must also be configured for the TPM external clock function through
 * the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b0 - TPM_CLKIN0 pin
 * - 0b1 - TPM_CLKIN1 pin
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_TPM1CLKSEL field. */
#define SIM_RD_SOPT9_TPM1CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_TPM1CLKSEL_MASK) >> SIM_SOPT9_TPM1CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_TPM1CLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT9_REG(base), SIM_SOPT9_TPM1CLKSEL_SHIFT))

/*! @brief Set the TPM1CLKSEL field to a new value. */
#define SIM_WR_SOPT9_TPM1CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_TPM1CLKSEL_MASK, SIM_SOPT9_TPM1CLKSEL(value)))
#define SIM_BWR_SOPT9_TPM1CLKSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT9_REG(base), SIM_SOPT9_TPM1CLKSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field TPM2CLKSEL[26] (RW)
 *
 * Selects the external pin used to drive the clock to the TPM2 module. The
 * selected pin must also be configured for the TPM external clock function through
 * the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b0 - TPM_CLKIN0 pin
 * - 0b1 - TPM_CLKIN1 pin
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_TPM2CLKSEL field. */
#define SIM_RD_SOPT9_TPM2CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_TPM2CLKSEL_MASK) >> SIM_SOPT9_TPM2CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_TPM2CLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT9_REG(base), SIM_SOPT9_TPM2CLKSEL_SHIFT))

/*! @brief Set the TPM2CLKSEL field to a new value. */
#define SIM_WR_SOPT9_TPM2CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_TPM2CLKSEL_MASK, SIM_SOPT9_TPM2CLKSEL(value)))
#define SIM_BWR_SOPT9_TPM2CLKSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT9_REG(base), SIM_SOPT9_TPM2CLKSEL_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_SDID - System Device Identification Register
 ******************************************************************************/

/*!
 * @brief SIM_SDID - System Device Identification Register (RO)
 *
 * Reset value: 0x00000380U
 */
/*!
 * @name Constants and macros for entire SIM_SDID register
 */
/*@{*/
#define SIM_RD_SDID(base)        (SIM_SDID_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_SDID bitfields
 */

/*!
 * @name Register SIM_SDID, field PINID[3:0] (RO)
 *
 * Specifies the pincount of the device.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - Reserved
 * - 0b0010 - 32-pin
 * - 0b0011 - Reserved
 * - 0b0100 - 48-pin
 * - 0b0101 - 64-pin
 * - 0b0110 - 80-pin
 * - 0b0111 - 81-pin or 121-pin
 * - 0b1000 - 100-pin
 * - 0b1001 - 121-pin
 * - 0b1010 - 144-pin
 * - 0b1011 - Custom pinout (WLCSP)
 * - 0b1100 - 169-pin
 * - 0b1101 - Reserved
 * - 0b1110 - 256-pin
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_PINID field. */
#define SIM_RD_SDID_PINID(base) ((SIM_SDID_REG(base) & SIM_SDID_PINID_MASK) >> SIM_SDID_PINID_SHIFT)
#define SIM_BRD_SDID_PINID(base) (SIM_RD_SDID_PINID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field FAMID[6:4] (RO)
 *
 * This field is maintained for compatibility only, but has been superceded by
 * the SERIESID, FAMILYID and SUBFAMID fields in this register.
 *
 * Values:
 * - 0b000 - K1x Family (without tamper)
 * - 0b001 - K2x Family (without tamper)
 * - 0b010 - K3x Family or K1x/K6x Family (with tamper)
 * - 0b011 - K4x Family or K2x Family (with tamper)
 * - 0b100 - K6x Family (without tamper)
 * - 0b101 - K7x Family
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_FAMID field. */
#define SIM_RD_SDID_FAMID(base) ((SIM_SDID_REG(base) & SIM_SDID_FAMID_MASK) >> SIM_SDID_FAMID_SHIFT)
#define SIM_BRD_SDID_FAMID(base) (SIM_RD_SDID_FAMID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field DIEID[11:7] (RO)
 *
 * Specifies the silicon feature set identication number for the device.
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_DIEID field. */
#define SIM_RD_SDID_DIEID(base) ((SIM_SDID_REG(base) & SIM_SDID_DIEID_MASK) >> SIM_SDID_DIEID_SHIFT)
#define SIM_BRD_SDID_DIEID(base) (SIM_RD_SDID_DIEID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field REVID[15:12] (RO)
 *
 * Specifies the silicon implementation number for the device.
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_REVID field. */
#define SIM_RD_SDID_REVID(base) ((SIM_SDID_REG(base) & SIM_SDID_REVID_MASK) >> SIM_SDID_REVID_SHIFT)
#define SIM_BRD_SDID_REVID(base) (SIM_RD_SDID_REVID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field SERIESID[23:20] (RO)
 *
 * Specifies the Kinetis series of the device.
 *
 * Values:
 * - 0b0000 - Kinetis K series
 * - 0b0001 - Kinetis L series
 * - 0b0101 - Kinetis W series
 * - 0b0110 - Kinetis V series
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SERIESID field. */
#define SIM_RD_SDID_SERIESID(base) ((SIM_SDID_REG(base) & SIM_SDID_SERIESID_MASK) >> SIM_SDID_SERIESID_SHIFT)
#define SIM_BRD_SDID_SERIESID(base) (SIM_RD_SDID_SERIESID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field SUBFAMID[27:24] (RO)
 *
 * Specifies the Kinetis sub-family of the device.
 *
 * Values:
 * - 0b0000 - Kx0 Subfamily
 * - 0b0001 - Kx1 Subfamily (tamper detect)
 * - 0b0010 - Kx2 Subfamily
 * - 0b0011 - Kx3 Subfamily (tamper detect)
 * - 0b0100 - Kx4 Subfamily
 * - 0b0101 - Kx5 Subfamily (tamper detect)
 * - 0b0110 - Kx6 Subfamily
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SUBFAMID field. */
#define SIM_RD_SDID_SUBFAMID(base) ((SIM_SDID_REG(base) & SIM_SDID_SUBFAMID_MASK) >> SIM_SDID_SUBFAMID_SHIFT)
#define SIM_BRD_SDID_SUBFAMID(base) (SIM_RD_SDID_SUBFAMID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field FAMILYID[31:28] (RO)
 *
 * Specifies the Kinetis family of the device.
 *
 * Values:
 * - 0b0000 - K0x Family
 * - 0b0001 - K1x Family
 * - 0b0010 - K2x Family
 * - 0b0011 - K3x Family
 * - 0b0100 - K4x Family
 * - 0b0110 - K6x Family
 * - 0b0111 - K7x Family
 * - 0b1000 - K8x Family
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_FAMILYID field. */
#define SIM_RD_SDID_FAMILYID(base) ((SIM_SDID_REG(base) & SIM_SDID_FAMILYID_MASK) >> SIM_SDID_FAMILYID_SHIFT)
#define SIM_BRD_SDID_FAMILYID(base) (SIM_RD_SDID_FAMILYID(base))
/*@}*/

