RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * SIM_UIDH - Unique Identification Register High
 ******************************************************************************/

/*!
 * @brief SIM_UIDH - Unique Identification Register High (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDH register
 */
/*@{*/
#define SIM_RD_UIDH(base)        (SIM_UIDH_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDMH - Unique Identification Register Mid-High
 ******************************************************************************/

/*!
 * @brief SIM_UIDMH - Unique Identification Register Mid-High (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDMH register
 */
/*@{*/
#define SIM_RD_UIDMH(base)       (SIM_UIDMH_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDML - Unique Identification Register Mid Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDML - Unique Identification Register Mid Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDML register
 */
/*@{*/
#define SIM_RD_UIDML(base)       (SIM_UIDML_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDL - Unique Identification Register Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDL - Unique Identification Register Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDL register
 */
/*@{*/
#define SIM_RD_UIDL(base)        (SIM_UIDL_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_CLKDIV3 - System Clock Divider Register 3
 ******************************************************************************/

/*!
 * @brief SIM_CLKDIV3 - System Clock Divider Register 3 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register should only be written when the LPUART, and TPM modules are
 * disabled.
 */
/*!
 * @name Constants and macros for entire SIM_CLKDIV3 register
 */
/*@{*/
#define SIM_RD_CLKDIV3(base)     (SIM_CLKDIV3_REG(base))
#define SIM_WR_CLKDIV3(base, value) (SIM_CLKDIV3_REG(base) = (value))
#define SIM_RMW_CLKDIV3(base, mask, value) (SIM_WR_CLKDIV3(base, (SIM_RD_CLKDIV3(base) & ~(mask)) | (value)))
#define SIM_SET_CLKDIV3(base, value) (SIM_WR_CLKDIV3(base, SIM_RD_CLKDIV3(base) |  (value)))
#define SIM_CLR_CLKDIV3(base, value) (SIM_WR_CLKDIV3(base, SIM_RD_CLKDIV3(base) & ~(value)))
#define SIM_TOG_CLKDIV3(base, value) (SIM_WR_CLKDIV3(base, SIM_RD_CLKDIV3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV3 bitfields
 */

/*!
 * @name Register SIM_CLKDIV3, field PLLFLLFRAC[0] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for various peripherals. The source clock for the fractional clock
 * divider is set by the SOPT2 PLLFLLSEL register bit. Divider output clock = Divider
 * input clock*((PLLFLLFRAC+1)/(PLLFLLDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV3_PLLFLLFRAC field. */
#define SIM_RD_CLKDIV3_PLLFLLFRAC(base) ((SIM_CLKDIV3_REG(base) & SIM_CLKDIV3_PLLFLLFRAC_MASK) >> SIM_CLKDIV3_PLLFLLFRAC_SHIFT)
#define SIM_BRD_CLKDIV3_PLLFLLFRAC(base) (BITBAND_ACCESS32(&SIM_CLKDIV3_REG(base), SIM_CLKDIV3_PLLFLLFRAC_SHIFT))

/*! @brief Set the PLLFLLFRAC field to a new value. */
#define SIM_WR_CLKDIV3_PLLFLLFRAC(base, value) (SIM_RMW_CLKDIV3(base, SIM_CLKDIV3_PLLFLLFRAC_MASK, SIM_CLKDIV3_PLLFLLFRAC(value)))
#define SIM_BWR_CLKDIV3_PLLFLLFRAC(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV3_REG(base), SIM_CLKDIV3_PLLFLLFRAC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV3, field PLLFLLDIV[3:1] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for various peripheral clocks. The source clock for the fractional clock
 * divider is set by the SOPT2 PLLFLLSEL register bit. Divider output clock =
 * Divider input clock * ((PLLFLLFRAC+1)/(PLLFLLDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV3_PLLFLLDIV field. */
#define SIM_RD_CLKDIV3_PLLFLLDIV(base) ((SIM_CLKDIV3_REG(base) & SIM_CLKDIV3_PLLFLLDIV_MASK) >> SIM_CLKDIV3_PLLFLLDIV_SHIFT)
#define SIM_BRD_CLKDIV3_PLLFLLDIV(base) (SIM_RD_CLKDIV3_PLLFLLDIV(base))

/*! @brief Set the PLLFLLDIV field to a new value. */
#define SIM_WR_CLKDIV3_PLLFLLDIV(base, value) (SIM_RMW_CLKDIV3(base, SIM_CLKDIV3_PLLFLLDIV_MASK, SIM_CLKDIV3_PLLFLLDIV(value)))
#define SIM_BWR_CLKDIV3_PLLFLLDIV(base, value) (SIM_WR_CLKDIV3_PLLFLLDIV(base, value))
/*@}*/

/*******************************************************************************
 * SIM_CLKDIV4 - System Clock Divider Register 4
 ******************************************************************************/

/*!
 * @brief SIM_CLKDIV4 - System Clock Divider Register 4 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register should only be written when the SOPT2 TRACECLKSEL register bit
 * is set.
 */
/*!
 * @name Constants and macros for entire SIM_CLKDIV4 register
 */
/*@{*/
#define SIM_RD_CLKDIV4(base)     (SIM_CLKDIV4_REG(base))
#define SIM_WR_CLKDIV4(base, value) (SIM_CLKDIV4_REG(base) = (value))
#define SIM_RMW_CLKDIV4(base, mask, value) (SIM_WR_CLKDIV4(base, (SIM_RD_CLKDIV4(base) & ~(mask)) | (value)))
#define SIM_SET_CLKDIV4(base, value) (SIM_WR_CLKDIV4(base, SIM_RD_CLKDIV4(base) |  (value)))
#define SIM_CLR_CLKDIV4(base, value) (SIM_WR_CLKDIV4(base, SIM_RD_CLKDIV4(base) & ~(value)))
#define SIM_TOG_CLKDIV4(base, value) (SIM_WR_CLKDIV4(base, SIM_RD_CLKDIV4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV4 bitfields
 */

/*!
 * @name Register SIM_CLKDIV4, field TRACEFRAC[0] (RW)
 *
 * This field sets the divide value for the MCGCLKOUT fractional clock divider
 * used as a source for trace clock. The source clock for the trace clock is set
 * by the SOPT2 TRACECLKSEL register bit. Divider output clock = Divider input
 * clock*((TRACEFRAC+1)/(TRACEDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEFRAC field. */
#define SIM_RD_CLKDIV4_TRACEFRAC(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEFRAC_MASK) >> SIM_CLKDIV4_TRACEFRAC_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEFRAC(base) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEFRAC_SHIFT))

