RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * USBHS_HCCPARAMS - Host Controller Capability Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HCCPARAMS - Host Controller Capability Parameters Register (RO)
 *
 * Reset value: 0x00000006U
 *
 * Identifies multiple mode control (time-base bit functionality) addressing
 * capability.
 */
/*!
 * @name Constants and macros for entire USBHS_HCCPARAMS register
 */
/*@{*/
#define USBHS_RD_HCCPARAMS(base) (USBHS_HCCPARAMS_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HCCPARAMS bitfields
 */

/*!
 * @name Register USBHS_HCCPARAMS, field ADC[0] (RO)
 *
 * This bit always reads as 0b0, indicating 64-bit addressing is not supported.
 * 0 Data structures use 32-bit address memory pointers
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCCPARAMS_ADC field. */
#define USBHS_RD_HCCPARAMS_ADC(base) ((USBHS_HCCPARAMS_REG(base) & USBHS_HCCPARAMS_ADC_MASK) >> USBHS_HCCPARAMS_ADC_SHIFT)
#define USBHS_BRD_HCCPARAMS_ADC(base) (BITBAND_ACCESS32(&USBHS_HCCPARAMS_REG(base), USBHS_HCCPARAMS_ADC_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HCCPARAMS, field PFL[1] (RO)
 *
 * Indicates that system software can specify and use a frame list length less
 * that 1024 elements. This bit always reads as 0b1. 1 Frame list size is
 * configured via the USBCMD register frame list size field. The frame list must always
 * be aligned on a 4K-page boundary. This requirement ensures that the frame list
 * is always physically contiguous.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCCPARAMS_PFL field. */
#define USBHS_RD_HCCPARAMS_PFL(base) ((USBHS_HCCPARAMS_REG(base) & USBHS_HCCPARAMS_PFL_MASK) >> USBHS_HCCPARAMS_PFL_SHIFT)
#define USBHS_BRD_HCCPARAMS_PFL(base) (BITBAND_ACCESS32(&USBHS_HCCPARAMS_REG(base), USBHS_HCCPARAMS_PFL_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HCCPARAMS, field ASP[2] (RO)
 *
 * Indicates if the host controller supports the park feature for high-speed
 * queue heads in the asynchronous schedule. The feature can be disabled or enabled
 * and set to a specific level by using the asynchronous schedule park mode
 * enable and asynchronous schedule park mode count fields in the USBCMD register.
 * This bit always reads as 0b1.
 *
 * Values:
 * - 0b0 - Park not supported.
 * - 0b1 - Park supported.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCCPARAMS_ASP field. */
#define USBHS_RD_HCCPARAMS_ASP(base) ((USBHS_HCCPARAMS_REG(base) & USBHS_HCCPARAMS_ASP_MASK) >> USBHS_HCCPARAMS_ASP_SHIFT)
#define USBHS_BRD_HCCPARAMS_ASP(base) (BITBAND_ACCESS32(&USBHS_HCCPARAMS_REG(base), USBHS_HCCPARAMS_ASP_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HCCPARAMS, field IST[7:4] (RO)
 *
 * Indicates where software can reliably update the isochronous schedule,
 * relative to the current position of the executing host controller. This field always
 * reads as 0x0.
 *
 * Values:
 * - 0b0000 - The value of the least significant 3 bits indicates the number of
 *     microframes a host controller can hold a set of isochronous data
 *     structures (one or more) before flushing the state
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCCPARAMS_IST field. */
#define USBHS_RD_HCCPARAMS_IST(base) ((USBHS_HCCPARAMS_REG(base) & USBHS_HCCPARAMS_IST_MASK) >> USBHS_HCCPARAMS_IST_SHIFT)
#define USBHS_BRD_HCCPARAMS_IST(base) (USBHS_RD_HCCPARAMS_IST(base))
/*@}*/

/*!
 * @name Register USBHS_HCCPARAMS, field EECP[15:8] (RO)
 *
 * This optional field indicates the existence of a capabilities list. This
 * field always reads as 0x000.
 *
 * Values:
 * - 0b00000000 - No extended capabilities are implemented
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCCPARAMS_EECP field. */
#define USBHS_RD_HCCPARAMS_EECP(base) ((USBHS_HCCPARAMS_REG(base) & USBHS_HCCPARAMS_EECP_MASK) >> USBHS_HCCPARAMS_EECP_SHIFT)
#define USBHS_BRD_HCCPARAMS_EECP(base) (USBHS_RD_HCCPARAMS_EECP(base))
/*@}*/

/*******************************************************************************
 * USBHS_DCIVERSION - Device Controller Interface Version
 ******************************************************************************/

/*!
 * @brief USBHS_DCIVERSION - Device Controller Interface Version (RO)
 *
 * Reset value: 0x0001U
 *
 * Not defined in the EHCI specification. DCIVERSION is a two-byte register
 * containing a BCD encoding of the device controller interface. The most-significant
 * byte of the register represents a major revision and the least-significant
 * byte is the minor revision.
 */
/*!
 * @name Constants and macros for entire USBHS_DCIVERSION register
 */
/*@{*/
#define USBHS_RD_DCIVERSION(base) (USBHS_DCIVERSION_REG(base))
/*@}*/

/*******************************************************************************
 * USBHS_DCCPARAMS - Device Controller Capability Parameters
 ******************************************************************************/

/*!
 * @brief USBHS_DCCPARAMS - Device Controller Capability Parameters (RO)
 *
 * Reset value: 0x00000184U
 *
 * Not defined in the EHCI specification. Register describes the overall
 * host/device capability of the USBHS module.
 */
/*!
 * @name Constants and macros for entire USBHS_DCCPARAMS register
 */
/*@{*/
#define USBHS_RD_DCCPARAMS(base) (USBHS_DCCPARAMS_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_DCCPARAMS bitfields
 */

/*!
 * @name Register USBHS_DCCPARAMS, field DEN[4:0] (RO)
 *
 * This field indicates the number of endpoints built into the device
 * controller. Always reads as 0b01000.
 */
/*@{*/
/*! @brief Read current value of the USBHS_DCCPARAMS_DEN field. */
#define USBHS_RD_DCCPARAMS_DEN(base) ((USBHS_DCCPARAMS_REG(base) & USBHS_DCCPARAMS_DEN_MASK) >> USBHS_DCCPARAMS_DEN_SHIFT)
#define USBHS_BRD_DCCPARAMS_DEN(base) (USBHS_RD_DCCPARAMS_DEN(base))
/*@}*/

/*!
 * @name Register USBHS_DCCPARAMS, field DC[7] (RO)
 *
 * Indicates the USBHS controller can operate as an USB 2.0 device. Always set.
 */
/*@{*/
/*! @brief Read current value of the USBHS_DCCPARAMS_DC field. */
#define USBHS_RD_DCCPARAMS_DC(base) ((USBHS_DCCPARAMS_REG(base) & USBHS_DCCPARAMS_DC_MASK) >> USBHS_DCCPARAMS_DC_SHIFT)
#define USBHS_BRD_DCCPARAMS_DC(base) (BITBAND_ACCESS32(&USBHS_DCCPARAMS_REG(base), USBHS_DCCPARAMS_DC_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_DCCPARAMS, field HC[8] (RO)
 *
 * Indicates the USBHS controller can operate as an EHCI compatible USB 2.0
 * host. Always reads as 0b1.
 */
/*@{*/
/*! @brief Read current value of the USBHS_DCCPARAMS_HC field. */
#define USBHS_RD_DCCPARAMS_HC(base) ((USBHS_DCCPARAMS_REG(base) & USBHS_DCCPARAMS_HC_MASK) >> USBHS_DCCPARAMS_HC_SHIFT)
#define USBHS_BRD_DCCPARAMS_HC(base) (BITBAND_ACCESS32(&USBHS_DCCPARAMS_REG(base), USBHS_DCCPARAMS_HC_SHIFT))
/*@}*/

