RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * USBHS_USBCMD - USB Command Register
 ******************************************************************************/

/*!
 * @brief USBHS_USBCMD - USB Command Register (RW)
 *
 * Reset value: 0x00080000U
 *
 * The module executes the command indicated in this register.
 */
/*!
 * @name Constants and macros for entire USBHS_USBCMD register
 */
/*@{*/
#define USBHS_RD_USBCMD(base)    (USBHS_USBCMD_REG(base))
#define USBHS_WR_USBCMD(base, value) (USBHS_USBCMD_REG(base) = (value))
#define USBHS_RMW_USBCMD(base, mask, value) (USBHS_WR_USBCMD(base, (USBHS_RD_USBCMD(base) & ~(mask)) | (value)))
#define USBHS_SET_USBCMD(base, value) (USBHS_WR_USBCMD(base, USBHS_RD_USBCMD(base) |  (value)))
#define USBHS_CLR_USBCMD(base, value) (USBHS_WR_USBCMD(base, USBHS_RD_USBCMD(base) & ~(value)))
#define USBHS_TOG_USBCMD(base, value) (USBHS_WR_USBCMD(base, USBHS_RD_USBCMD(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_USBCMD bitfields
 */

/*!
 * @name Register USBHS_USBCMD, field RS[0] (RW)
 *
 * Host mode: When set, the controller proceeds with the execution of the
 * schedule. The controller continues execution as long as this bit is set. When this
 * bit is cleared, the controller completes the current transaction on the USB and
 * then halts. The USBSTS[HCH] bit indicates when the host controller finishes
 * the transaction and enters the stopped state. Software must not set this bit
 * unless controller is in halted state (USBSTS[HCH] = 1). Device mode: Setting
 * this bit causes the controller to enable a pull-up on DP and initiate an attach
 * event. This control bit is not directly connected to the pull-up enable, as the
 * pull-up becomes disabled upon transitioning into high-speed mode. Software
 * must use this bit to prevent an attach event before the USBHS controller has
 * properly initialized. Clearing this bit causes a detach event.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_RS field. */
#define USBHS_RD_USBCMD_RS(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_RS_MASK) >> USBHS_USBCMD_RS_SHIFT)
#define USBHS_BRD_USBCMD_RS(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_RS_SHIFT))

/*! @brief Set the RS field to a new value. */
#define USBHS_WR_USBCMD_RS(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_RS_MASK, USBHS_USBCMD_RS(value)))
#define USBHS_BWR_USBCMD_RS(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_RS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field RST[1] (RW)
 *
 * Software uses this bit to reset controller. Controller clears this bit when
 * reset process completes. Clearing this register does not allow software to
 * terminate the reset process early. Host mode: When software sets this bit, the
 * controller resets its internal pipelines, timers, counters, state machines etc.
 * to their initial value. Any transaction in progress on the USB immediately
 * terminates. A USB reset is not driven on downstream ports. Software must not set
 * this bit when the USBSTS[HCH] bit is cleared. Attempting to reset an actively
 * running host controller results in undefined behavior. Device mode: When
 * software sets this bit, the controller resets its internal pipelines, timers,
 * counters, state machines, etc. to their initial value. Setting this bit with the
 * device in the attached state is not recommended because it has an undefined
 * effect on an attached host. To ensure the device is not in an attached state before
 * initiating a device controller reset, all primed endpoints must be flushed
 * and the USBCMD[RS] bit must be cleared.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_RST field. */
#define USBHS_RD_USBCMD_RST(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_RST_MASK) >> USBHS_USBCMD_RST_SHIFT)
#define USBHS_BRD_USBCMD_RST(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_RST_SHIFT))

/*! @brief Set the RST field to a new value. */
#define USBHS_WR_USBCMD_RST(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_RST_MASK, USBHS_USBCMD_RST(value)))
#define USBHS_BWR_USBCMD_RST(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_RST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field FS[3:2] (RW)
 *
 * With bit 15, these bits make the FS[2:0] field, which specifies the frame
 * list size controlling which bits in the frame index register must be used for the
 * frame list current index. Used only in host mode. Values below 256 elements
 * are not defined in the EHCI specification.
 *
 * Values:
 * - 0b00 - When FS2 = 0, the size is 1024 elements (4096 bytes). When FS2 = 1,
 *     the size is 64 elements (256 bytes).
 * - 0b01 - When FS2 = 0, the size is 512 elements (2048 bytes). When FS2 = 1,
 *     the size is 32 elements (128 bytes).
 * - 0b10 - When FS2 = 0, the size is 256 elements (1024 bytes). When FS2 = 1,
 *     the size is 16 elements (64 bytes).
 * - 0b11 - When FS2 = 0, the size is 128 elements (512 bytes). When FS2 = 1,
 *     the size is 8 elements (32 bytes).
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_FS field. */
#define USBHS_RD_USBCMD_FS(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_FS_MASK) >> USBHS_USBCMD_FS_SHIFT)
#define USBHS_BRD_USBCMD_FS(base) (USBHS_RD_USBCMD_FS(base))

/*! @brief Set the FS field to a new value. */
#define USBHS_WR_USBCMD_FS(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_FS_MASK, USBHS_USBCMD_FS(value)))
#define USBHS_BWR_USBCMD_FS(base, value) (USBHS_WR_USBCMD_FS(base, value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field PSE[4] (RW)
 *
 * Controls whether the controller skips processing periodic schedule. Used only
 * in host mode.
 *
 * Values:
 * - 0b0 - Do not process periodic schedule.
 * - 0b1 - Use the PERIODICLISTBASE register to access the periodic schedule.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_PSE field. */
#define USBHS_RD_USBCMD_PSE(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_PSE_MASK) >> USBHS_USBCMD_PSE_SHIFT)
#define USBHS_BRD_USBCMD_PSE(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_PSE_SHIFT))

/*! @brief Set the PSE field to a new value. */
#define USBHS_WR_USBCMD_PSE(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_PSE_MASK, USBHS_USBCMD_PSE(value)))
#define USBHS_BWR_USBCMD_PSE(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_PSE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field ASE[5] (RW)
 *
 * Controls whether the controller skips processing the asynchronous schedule.
 * Only used in host mode.
 *
 * Values:
 * - 0b0 - Do not process asynchronous schedule.
 * - 0b1 - Use the ASYNCLISTADDR register to access asynchronous schedule.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_ASE field. */
#define USBHS_RD_USBCMD_ASE(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_ASE_MASK) >> USBHS_USBCMD_ASE_SHIFT)
#define USBHS_BRD_USBCMD_ASE(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_ASE_SHIFT))

/*! @brief Set the ASE field to a new value. */
#define USBHS_WR_USBCMD_ASE(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_ASE_MASK, USBHS_USBCMD_ASE(value)))
#define USBHS_BWR_USBCMD_ASE(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_ASE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field IAA[6] (RW)
 *
 * Used as a doorbell by software to tell controller to issue an interrupt the
 * next time it advances the asynchronous schedule. Software must write a 1 to
 * this bit to ring the doorbell. When controller has evicted all appropriate cached
 * schedule states, it sets USBSTS[AAI] register. If the USBINTR[AAE] bit is
 * set, the host controller asserts an interrupt at the next interrupt threshold.
 * The controller clears this bit after it has set the USBSTS[AAI] bit. Software
 * must not write a 1 to this bit when the asynchronous schedule is inactive. Doing
 * so yields undefined results. This bit used only in host mode. Writing a 1 to
 * this bit when the USBHS module is in device mode has undefined results.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_IAA field. */
#define USBHS_RD_USBCMD_IAA(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_IAA_MASK) >> USBHS_USBCMD_IAA_SHIFT)
#define USBHS_BRD_USBCMD_IAA(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_IAA_SHIFT))

/*! @brief Set the IAA field to a new value. */
#define USBHS_WR_USBCMD_IAA(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_IAA_MASK, USBHS_USBCMD_IAA(value)))
#define USBHS_BWR_USBCMD_IAA(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_IAA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field ASP[9:8] (RW)
 *
 * Contains a count of the successive transactions the host controller can
 * execute from a high-speed queue head on the asynchronous schedule before continuing
 * traversal of the asynchronous schedule. Valid values are 0b1 to 0b11.
 * Software must not write a zero to this field when ASPE is set as this results in
 * undefined behavior.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_ASP field. */
#define USBHS_RD_USBCMD_ASP(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_ASP_MASK) >> USBHS_USBCMD_ASP_SHIFT)
#define USBHS_BRD_USBCMD_ASP(base) (USBHS_RD_USBCMD_ASP(base))

/*! @brief Set the ASP field to a new value. */
#define USBHS_WR_USBCMD_ASP(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_ASP_MASK, USBHS_USBCMD_ASP(value)))
#define USBHS_BWR_USBCMD_ASP(base, value) (USBHS_WR_USBCMD_ASP(base, value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field ASPE[11] (RW)
 *
 * Software uses this bit to enable or disable park mode.
 *
 * Values:
 * - 0b0 - Park mode disabled
 * - 0b1 - Park mode enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_ASPE field. */
#define USBHS_RD_USBCMD_ASPE(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_ASPE_MASK) >> USBHS_USBCMD_ASPE_SHIFT)
#define USBHS_BRD_USBCMD_ASPE(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_ASPE_SHIFT))

