RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the ASPE field to a new value. */
#define USBHS_WR_USBCMD_ASPE(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_ASPE_MASK, USBHS_USBCMD_ASPE(value)))
#define USBHS_BWR_USBCMD_ASPE(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_ASPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field SUTW[13] (RW)
 *
 * This is a non-EHCI bit. Used as a semaphore to ensure that the setup data
 * payload of 8 bytes is extracted from a QH by driver software without being
 * corrupted. If the setup lockout mode is off (USBMODE[SLOM] = 1) then a hazard exists
 * when new setup data arrives, and the software copies setup from the QH for a
 * previous setup packet. This bit is set and cleared by software and is cleared
 * by hardware when a hazard exists. More information appears in section "Control
 * Endpoint Operation."
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_SUTW field. */
#define USBHS_RD_USBCMD_SUTW(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_SUTW_MASK) >> USBHS_USBCMD_SUTW_SHIFT)
#define USBHS_BRD_USBCMD_SUTW(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_SUTW_SHIFT))

/*! @brief Set the SUTW field to a new value. */
#define USBHS_WR_USBCMD_SUTW(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_SUTW_MASK, USBHS_USBCMD_SUTW(value)))
#define USBHS_BWR_USBCMD_SUTW(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_SUTW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field ATDTW[14] (RW)
 *
 * This is a non-EHCI bit. This bit is used as a semaphore when a dTD is added
 * to an active (primed) endpoint. This bit is set and cleared by software. This
 * bit is also cleared by hardware when the state machine is in a hazard region
 * where adding a dTD to a primed endpoint may go unrecognized. More information
 * appears in section "Executing a Transfer Descriptor."
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_ATDTW field. */
#define USBHS_RD_USBCMD_ATDTW(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_ATDTW_MASK) >> USBHS_USBCMD_ATDTW_SHIFT)
#define USBHS_BRD_USBCMD_ATDTW(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_ATDTW_SHIFT))

/*! @brief Set the ATDTW field to a new value. */
#define USBHS_WR_USBCMD_ATDTW(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_ATDTW_MASK, USBHS_USBCMD_ATDTW(value)))
#define USBHS_BWR_USBCMD_ATDTW(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_ATDTW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field FS2[15] (RW)
 *
 * See the FS bit description below. This is a non-EHCI bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_FS2 field. */
#define USBHS_RD_USBCMD_FS2(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_FS2_MASK) >> USBHS_USBCMD_FS2_SHIFT)
#define USBHS_BRD_USBCMD_FS2(base) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_FS2_SHIFT))

/*! @brief Set the FS2 field to a new value. */
#define USBHS_WR_USBCMD_FS2(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_FS2_MASK, USBHS_USBCMD_FS2(value)))
#define USBHS_BWR_USBCMD_FS2(base, value) (BITBAND_ACCESS32(&USBHS_USBCMD_REG(base), USBHS_USBCMD_FS2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBCMD, field ITC[23:16] (RW)
 *
 * System software uses this field to set the maximum rate at which the module
 * issues interrupts. ITC contains maximum interrupt interval measured in
 * microframes.
 *
 * Values:
 * - 0b00000000 - Immediate (no threshold)
 * - 0b00000001 - 1 microframe
 * - 0b00000010 - 2 microframes
 * - 0b00000100 - 4 microframes
 * - 0b00001000 - 8 microframes
 * - 0b00010000 - 16 microframes
 * - 0b00100000 - 32 microframes
 * - 0b01000000 - 64 microframes
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBCMD_ITC field. */
#define USBHS_RD_USBCMD_ITC(base) ((USBHS_USBCMD_REG(base) & USBHS_USBCMD_ITC_MASK) >> USBHS_USBCMD_ITC_SHIFT)
#define USBHS_BRD_USBCMD_ITC(base) (USBHS_RD_USBCMD_ITC(base))

/*! @brief Set the ITC field to a new value. */
#define USBHS_WR_USBCMD_ITC(base, value) (USBHS_RMW_USBCMD(base, USBHS_USBCMD_ITC_MASK, USBHS_USBCMD_ITC(value)))
#define USBHS_BWR_USBCMD_ITC(base, value) (USBHS_WR_USBCMD_ITC(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_USBSTS - USB Status Register
 ******************************************************************************/

/*!
 * @brief USBHS_USBSTS - USB Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register indicates various states of each module and any pending
 * interrupts. This register does not indicate status resulting from a transaction on
 * the serial bus. Software clears certain bits in this register by writing a 1 to
 * them.
 */
/*!
 * @name Constants and macros for entire USBHS_USBSTS register
 */
/*@{*/
#define USBHS_RD_USBSTS(base)    (USBHS_USBSTS_REG(base))
#define USBHS_WR_USBSTS(base, value) (USBHS_USBSTS_REG(base) = (value))
#define USBHS_RMW_USBSTS(base, mask, value) (USBHS_WR_USBSTS(base, (USBHS_RD_USBSTS(base) & ~(mask)) | (value)))
#define USBHS_SET_USBSTS(base, value) (USBHS_WR_USBSTS(base, USBHS_RD_USBSTS(base) |  (value)))
#define USBHS_CLR_USBSTS(base, value) (USBHS_WR_USBSTS(base, USBHS_RD_USBSTS(base) & ~(value)))
#define USBHS_TOG_USBSTS(base, value) (USBHS_WR_USBSTS(base, USBHS_RD_USBSTS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_USBSTS bitfields
 */

/*!
 * @name Register USBHS_USBSTS, field UI[0] (W1C)
 *
 * This bit is set by the controller when the cause of an interrupt is a
 * completion of a USB transaction where the TD has an interrupt on complete (IOC) bit
 * set. This bit is also set by the controller when a short packet is detected. A
 * short packet is when the actual number of bytes received was less than the
 * expected number of bytes.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_UI field. */
#define USBHS_RD_USBSTS_UI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_UI_MASK) >> USBHS_USBSTS_UI_SHIFT)
#define USBHS_BRD_USBSTS_UI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UI_SHIFT))

/*! @brief Set the UI field to a new value. */
#define USBHS_WR_USBSTS_UI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_UI(value)))
#define USBHS_BWR_USBSTS_UI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field UEI[1] (W1C)
 *
 * When completion of USB transaction results in error condition, the controller
 * sets this bit. If the TD on which the error interrupt occurred also had its
 * interrupt on complete (IOC) bit set, this bit is set along with the USBINT bit.
 * See Section 4.15.1 in the EHCI specification for a complete list of host
 * error interrupt conditions. See Table 24-62 for more information on device error
 * matrix.
 *
 * Values:
 * - 0b0 - No error
 * - 0b1 - Error detected
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_UEI field. */
#define USBHS_RD_USBSTS_UEI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_UEI_MASK) >> USBHS_USBSTS_UEI_SHIFT)
#define USBHS_BRD_USBSTS_UEI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UEI_SHIFT))

/*! @brief Set the UEI field to a new value. */
#define USBHS_WR_USBSTS_UEI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_UEI(value)))
#define USBHS_BWR_USBSTS_UEI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_UEI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field PCI[2] (W1C)
 *
 * This bit is not EHCI compatible. Host mode: Controller sets this bit when a
 * connect status occurs on any port, a port enable/disable change occurs, an
 * over-current change occurs, or the force port resume (PORTSCn[FPR]) bit is set as
 * the result of a J-K transition on the suspended port. Device mode: The
 * controller sets this bit when it enters the full- or high-speed operational state.
 * When it exits the full- or high-speed operation states due to reset or suspend
 * events, the notification mechanisms are URI and SLI bits respectively. The
 * device controller detects resume signaling only.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_PCI field. */
#define USBHS_RD_USBSTS_PCI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_PCI_MASK) >> USBHS_USBSTS_PCI_SHIFT)
#define USBHS_BRD_USBSTS_PCI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_PCI_SHIFT))

/*! @brief Set the PCI field to a new value. */
#define USBHS_WR_USBSTS_PCI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_PCI(value)))
#define USBHS_BWR_USBSTS_PCI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_PCI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field FRI[3] (W1C)
 *
 * Controller sets this bit when the frame list index (FRINDEX) rolls over from
 * its maximum value to 0. The exact value the rollover occurs depends on the
 * frame list size. For example, if the frame list size (as programmed in the
 * USBCMD[FS] field) is 1024, the frame index register rolls over every time
 * FRINDEX[13] toggles. Similarly, if the size is 512, the controller sets this bit each
 * time FRINDEX[12] toggles. Used only in the host mode.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_FRI field. */
#define USBHS_RD_USBSTS_FRI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_FRI_MASK) >> USBHS_USBSTS_FRI_SHIFT)
#define USBHS_BRD_USBSTS_FRI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_FRI_SHIFT))

/*! @brief Set the FRI field to a new value. */
#define USBHS_WR_USBSTS_FRI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_FRI(value)))
#define USBHS_BWR_USBSTS_FRI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_FRI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field SEI[4] (W1C)
 *
 * Set when an error is detected on the system bus. If the system error enable
 * bit (USBINTR[SEE]) is set, interrupt generates. The interrupt and status bits
 * remain set until cleared by writing a 1 to this bit. Additionally, when in host
 * mode, the USBCMD[RS] bit is cleared, effectively disabling controller. An
 * interrupt generates for the USBHS controller in device mode, but no other action
 * is taken.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Error
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_SEI field. */
#define USBHS_RD_USBSTS_SEI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_SEI_MASK) >> USBHS_USBSTS_SEI_SHIFT)
#define USBHS_BRD_USBSTS_SEI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_SEI_SHIFT))

/*! @brief Set the SEI field to a new value. */
#define USBHS_WR_USBSTS_SEI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_SEI(value)))
#define USBHS_BWR_USBSTS_SEI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_SEI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field AAI[5] (W1C)
 *
 * By setting the USBCMD[IAA] bit, system software can force the controller to
 * issue an interrupt the next time the controller advances the asynchronous
 * schedule. This status bit indicates the assertion of that interrupt source. Used
 * only by the host mode.
 *
 * Values:
 * - 0b0 - No async advance interrupt
 * - 0b1 - Async advance interrupt
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_AAI field. */
#define USBHS_RD_USBSTS_AAI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_AAI_MASK) >> USBHS_USBSTS_AAI_SHIFT)
#define USBHS_BRD_USBSTS_AAI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_AAI_SHIFT))

/*! @brief Set the AAI field to a new value. */
#define USBHS_WR_USBSTS_AAI(base, value) (USBHS_RMW_USBSTS(base, (USBHS_USBSTS_AAI_MASK | USBHS_USBSTS_UI_MASK | USBHS_USBSTS_UEI_MASK | USBHS_USBSTS_PCI_MASK | USBHS_USBSTS_FRI_MASK | USBHS_USBSTS_SEI_MASK | USBHS_USBSTS_URI_MASK | USBHS_USBSTS_SRI_MASK | USBHS_USBSTS_SLI_MASK | USBHS_USBSTS_TI0_MASK | USBHS_USBSTS_TI1_MASK), USBHS_USBSTS_AAI(value)))
#define USBHS_BWR_USBSTS_AAI(base, value) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_AAI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBSTS, field URI[6] (W1C)
 *
 * A non-EHCI bit. When the controller detects a USB reset and enters the
 * default state, this bit is set. Software can write a 1 to this bit to clear it. Used
 * only by in device mode.
 *
 * Values:
 * - 0b0 - No reset received
 * - 0b1 - Reset received
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBSTS_URI field. */
#define USBHS_RD_USBSTS_URI(base) ((USBHS_USBSTS_REG(base) & USBHS_USBSTS_URI_MASK) >> USBHS_USBSTS_URI_SHIFT)
#define USBHS_BRD_USBSTS_URI(base) (BITBAND_ACCESS32(&USBHS_USBSTS_REG(base), USBHS_USBSTS_URI_SHIFT))

