RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*
 * Constants & macros for individual USBHS_BURSTSIZE bitfields
 */

/*!
 * @name Register USBHS_BURSTSIZE, field RXPBURST[7:0] (RW)
 *
 * This register represents the maximum length of a burst in 32-bit words while
 * moving data from the USB bus to system memory. Must not be set to greater than
 * 16. If the BURSTSIZE field of register SBUSCFG is non-zero, the RXPBURST
 * field returns the value of the INCRx length.
 */
/*@{*/
/*! @brief Read current value of the USBHS_BURSTSIZE_RXPBURST field. */
#define USBHS_RD_BURSTSIZE_RXPBURST(base) ((USBHS_BURSTSIZE_REG(base) & USBHS_BURSTSIZE_RXPBURST_MASK) >> USBHS_BURSTSIZE_RXPBURST_SHIFT)
#define USBHS_BRD_BURSTSIZE_RXPBURST(base) (USBHS_RD_BURSTSIZE_RXPBURST(base))

/*! @brief Set the RXPBURST field to a new value. */
#define USBHS_WR_BURSTSIZE_RXPBURST(base, value) (USBHS_RMW_BURSTSIZE(base, USBHS_BURSTSIZE_RXPBURST_MASK, USBHS_BURSTSIZE_RXPBURST(value)))
#define USBHS_BWR_BURSTSIZE_RXPBURST(base, value) (USBHS_WR_BURSTSIZE_RXPBURST(base, value))
/*@}*/

/*!
 * @name Register USBHS_BURSTSIZE, field TXPBURST[15:8] (RW)
 *
 * Represents the maximum length of a burst in 32-bit words while moving data
 * from system memory to the USB bus. Must not be set to greater than 16. If the
 * BURSTSIZE field of register SBUSCFG is non-zero, the TXPBURST field returns the
 * value of the INCRx length.
 */
/*@{*/
/*! @brief Read current value of the USBHS_BURSTSIZE_TXPBURST field. */
#define USBHS_RD_BURSTSIZE_TXPBURST(base) ((USBHS_BURSTSIZE_REG(base) & USBHS_BURSTSIZE_TXPBURST_MASK) >> USBHS_BURSTSIZE_TXPBURST_SHIFT)
#define USBHS_BRD_BURSTSIZE_TXPBURST(base) (USBHS_RD_BURSTSIZE_TXPBURST(base))

/*! @brief Set the TXPBURST field to a new value. */
#define USBHS_WR_BURSTSIZE_TXPBURST(base, value) (USBHS_RMW_BURSTSIZE(base, USBHS_BURSTSIZE_TXPBURST_MASK, USBHS_BURSTSIZE_TXPBURST(value)))
#define USBHS_BWR_BURSTSIZE_TXPBURST(base, value) (USBHS_WR_BURSTSIZE_TXPBURST(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_TXFILLTUNING - Transmit FIFO Tuning Control Register
 ******************************************************************************/

/*!
 * @brief USBHS_TXFILLTUNING - Transmit FIFO Tuning Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. The TXFILLTUNING
 * register controls performance tuning associated with how the module posts data to
 * the TX latency FIFO before moving the data onto the USB bus. The specific
 * areas of performance include how much data to post into the FIFO and an estimate
 * for how long that operation takes in the target system. Definitions: T 0 =
 * Standard packet overhead T 1 = Time to send data payload T s = Total packet flight
 * time (send-only) packet (T s = T 0 + T 1 ) T ff Time to fetch packet into TX
 * FIFO up to specified level T p Total packet time (fetch and send) packet (T p
 * = T ff + T s ) Upon discovery of a transmit (OUT/SETUP) packet in the data
 * structures, the host controller checks to ensure T p remains before the end of
 * the (micro)frame. If so, it pre-fills the TX FIFO. If at anytime during the
 * pre-fill operation the time remaining the (micro)frame is less than T s , packet
 * attempt ceases and tries at a later time. Although this is not an error
 * condition and the module eventually recovers, a mark is made in the scheduler health
 * counter to mark the occurrence of a back-off event. When a back-off event is
 * detected, the partial packet fetched may need to be discarded from the latency
 * buffer to make room for periodic traffic beginning after the next SOF. Too
 * many back-off events can waste bandwidth and power on the system bus and should
 * be minimized (not necessarily eliminated). The TSCHHEALTH (T ff) parameter
 * described below can minimize back-offs.
 */
/*!
 * @name Constants and macros for entire USBHS_TXFILLTUNING register
 */
/*@{*/
#define USBHS_RD_TXFILLTUNING(base) (USBHS_TXFILLTUNING_REG(base))
#define USBHS_WR_TXFILLTUNING(base, value) (USBHS_TXFILLTUNING_REG(base) = (value))
#define USBHS_RMW_TXFILLTUNING(base, mask, value) (USBHS_WR_TXFILLTUNING(base, (USBHS_RD_TXFILLTUNING(base) & ~(mask)) | (value)))
#define USBHS_SET_TXFILLTUNING(base, value) (USBHS_WR_TXFILLTUNING(base, USBHS_RD_TXFILLTUNING(base) |  (value)))
#define USBHS_CLR_TXFILLTUNING(base, value) (USBHS_WR_TXFILLTUNING(base, USBHS_RD_TXFILLTUNING(base) & ~(value)))
#define USBHS_TOG_TXFILLTUNING(base, value) (USBHS_WR_TXFILLTUNING(base, USBHS_RD_TXFILLTUNING(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_TXFILLTUNING bitfields
 */

/*!
 * @name Register USBHS_TXFILLTUNING, field TXSCHOH[6:0] (RW)
 *
 * These bits add an additional fixed offset to the schedule time estimator
 * described as T ff . As an approximation, the value chosen for this register should
 * limit the number of back-off events captured in the TXSCHHEALTH field to less
 * than 10 per second in a highly utilized bus. Choosing a value too high for
 * this register is not desired as it can needlessly reduce USB utilization. The
 * time unit represented in this register is 1.267 ms when a device connects in
 * high-speed mode. The time unit represented in this register is 6.333 ms when a
 * device connects in low-/full-speed mode. For most applications, TXSCHOH can be
 * set to 4 or less. A good value to begin with is: (TXFIFOTHRES x BURSTSIZE x 4)
 * / (40 x TimeUnit) Always rounded to the next higher integer. TimeUnit is 1.267
 * or 6.333 as noted earlier in this description. For example, if TXFIFOTHRES is
 * 5 and BURSTSIZE is 8, set TXSCHOH to 5 x (8 x 4)/(40 x 1.267) equals 4 for a
 * high-speed link. If this value of TXSCHOH results in a TXSCHHEALTH count of 0
 * per second, low the value by 1 if optimizing performance is desired. If
 * TXSCHHEALTH exceeds 10 per second, raise the value by 1. If streaming mode is
 * disabled via the USBMODE register, treat TXFIFOTHRES as the maximum value for
 * purposes of the TXSCHOH calculation.
 */
/*@{*/
/*! @brief Read current value of the USBHS_TXFILLTUNING_TXSCHOH field. */
#define USBHS_RD_TXFILLTUNING_TXSCHOH(base) ((USBHS_TXFILLTUNING_REG(base) & USBHS_TXFILLTUNING_TXSCHOH_MASK) >> USBHS_TXFILLTUNING_TXSCHOH_SHIFT)
#define USBHS_BRD_TXFILLTUNING_TXSCHOH(base) (USBHS_RD_TXFILLTUNING_TXSCHOH(base))

/*! @brief Set the TXSCHOH field to a new value. */
#define USBHS_WR_TXFILLTUNING_TXSCHOH(base, value) (USBHS_RMW_TXFILLTUNING(base, USBHS_TXFILLTUNING_TXSCHOH_MASK, USBHS_TXFILLTUNING_TXSCHOH(value)))
#define USBHS_BWR_TXFILLTUNING_TXSCHOH(base, value) (USBHS_WR_TXFILLTUNING_TXSCHOH(base, value))
/*@}*/

/*!
 * @name Register USBHS_TXFILLTUNING, field TXSCHHEALTH[12:8] (RW)
 *
 * These bits increment when the host controller fails to fill the TX latency
 * FIFO to the level programmed by TXFIFOTHRES before running out of time to send
 * the packet before the next SOF. This health counter measures the number of
 * times this occurs to provide feedback to selecting a proper TXSCHOH. Writing to
 * this register clears the counter and this counter stops counting after reaching
 * the maximum of 31.
 */
/*@{*/
/*! @brief Read current value of the USBHS_TXFILLTUNING_TXSCHHEALTH field. */
#define USBHS_RD_TXFILLTUNING_TXSCHHEALTH(base) ((USBHS_TXFILLTUNING_REG(base) & USBHS_TXFILLTUNING_TXSCHHEALTH_MASK) >> USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT)
#define USBHS_BRD_TXFILLTUNING_TXSCHHEALTH(base) (USBHS_RD_TXFILLTUNING_TXSCHHEALTH(base))

/*! @brief Set the TXSCHHEALTH field to a new value. */
#define USBHS_WR_TXFILLTUNING_TXSCHHEALTH(base, value) (USBHS_RMW_TXFILLTUNING(base, USBHS_TXFILLTUNING_TXSCHHEALTH_MASK, USBHS_TXFILLTUNING_TXSCHHEALTH(value)))
#define USBHS_BWR_TXFILLTUNING_TXSCHHEALTH(base, value) (USBHS_WR_TXFILLTUNING_TXSCHHEALTH(base, value))
/*@}*/

/*!
 * @name Register USBHS_TXFILLTUNING, field TXFIFOTHRES[21:16] (RW)
 *
 * FIFO burst threshold. Controls the number of data bursts that are posted to
 * the TX latency FIFO in host mode before the packet begins on the bus. The
 * minimum value is 2 and this value should be as low as possible to maximize USB
 * performance. Systems with unpredictable latency and/or insufficient bandwidth can
 * use a higher value where the FIFO may underrun because the data transferred
 * from the latency FIFO to USB occurs before it can replenish from system memory.
 * This value is ignored if the USBMODE[SDIS] bit is set. When the USBMODE[SDIS]
 * bit is set, the host controller behaves as if TXFIFOTHRES is set to its
 * maximum value.
 */
/*@{*/
/*! @brief Read current value of the USBHS_TXFILLTUNING_TXFIFOTHRES field. */
#define USBHS_RD_TXFILLTUNING_TXFIFOTHRES(base) ((USBHS_TXFILLTUNING_REG(base) & USBHS_TXFILLTUNING_TXFIFOTHRES_MASK) >> USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT)
#define USBHS_BRD_TXFILLTUNING_TXFIFOTHRES(base) (USBHS_RD_TXFILLTUNING_TXFIFOTHRES(base))

/*! @brief Set the TXFIFOTHRES field to a new value. */
#define USBHS_WR_TXFILLTUNING_TXFIFOTHRES(base, value) (USBHS_RMW_TXFILLTUNING(base, USBHS_TXFILLTUNING_TXFIFOTHRES_MASK, USBHS_TXFILLTUNING_TXFIFOTHRES(value)))
#define USBHS_BWR_TXFILLTUNING_TXFIFOTHRES(base, value) (USBHS_WR_TXFILLTUNING_TXFIFOTHRES(base, value))
/*@}*/

