RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * USBHS_ENDPTNAK - Endpoint NAK Register
 ******************************************************************************/

/*!
 * @brief USBHS_ENDPTNAK - Endpoint NAK Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire USBHS_ENDPTNAK register
 */
/*@{*/
#define USBHS_RD_ENDPTNAK(base)  (USBHS_ENDPTNAK_REG(base))
#define USBHS_WR_ENDPTNAK(base, value) (USBHS_ENDPTNAK_REG(base) = (value))
#define USBHS_RMW_ENDPTNAK(base, mask, value) (USBHS_WR_ENDPTNAK(base, (USBHS_RD_ENDPTNAK(base) & ~(mask)) | (value)))
#define USBHS_SET_ENDPTNAK(base, value) (USBHS_WR_ENDPTNAK(base, USBHS_RD_ENDPTNAK(base) |  (value)))
#define USBHS_CLR_ENDPTNAK(base, value) (USBHS_WR_ENDPTNAK(base, USBHS_RD_ENDPTNAK(base) & ~(value)))
#define USBHS_TOG_ENDPTNAK(base, value) (USBHS_WR_ENDPTNAK(base, USBHS_RD_ENDPTNAK(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_ENDPTNAK bitfields
 */

/*!
 * @name Register USBHS_ENDPTNAK, field EPRN[3:0] (W1C)
 *
 * Each RX endpoint has 1 bit in this field. The bit is set when the device
 * sends a NAK handshake on a received OUT or PING token for the corresponding
 * endpoint. EPRN[3]-Endpoint #3 EPRN[2]-Endpoint #2 EPRN[1]-Endpoint #1
 * EPRN[0]-Endpoint #0
 */
/*@{*/
/*! @brief Read current value of the USBHS_ENDPTNAK_EPRN field. */
#define USBHS_RD_ENDPTNAK_EPRN(base) ((USBHS_ENDPTNAK_REG(base) & USBHS_ENDPTNAK_EPRN_MASK) >> USBHS_ENDPTNAK_EPRN_SHIFT)
#define USBHS_BRD_ENDPTNAK_EPRN(base) (USBHS_RD_ENDPTNAK_EPRN(base))

/*! @brief Set the EPRN field to a new value. */
#define USBHS_WR_ENDPTNAK_EPRN(base, value) (USBHS_RMW_ENDPTNAK(base, (USBHS_ENDPTNAK_EPRN_MASK | USBHS_ENDPTNAK_EPTN_MASK), USBHS_ENDPTNAK_EPRN(value)))
#define USBHS_BWR_ENDPTNAK_EPRN(base, value) (USBHS_WR_ENDPTNAK_EPRN(base, value))
/*@}*/

/*!
 * @name Register USBHS_ENDPTNAK, field EPTN[19:16] (W1C)
 *
 * Each TX endpoint has 1 bit in this field. The bit is set when the device
 * sends a NAK handshake on a received IN token for the corresponding endpoint.
 * EPTN[3]-Endpoint #3 EPTN[2]-Endpoint #2 EPTN[1]-Endpoint #1 EPTN[0]-Endpoint #0
 */
/*@{*/
/*! @brief Read current value of the USBHS_ENDPTNAK_EPTN field. */
#define USBHS_RD_ENDPTNAK_EPTN(base) ((USBHS_ENDPTNAK_REG(base) & USBHS_ENDPTNAK_EPTN_MASK) >> USBHS_ENDPTNAK_EPTN_SHIFT)
#define USBHS_BRD_ENDPTNAK_EPTN(base) (USBHS_RD_ENDPTNAK_EPTN(base))

/*! @brief Set the EPTN field to a new value. */
#define USBHS_WR_ENDPTNAK_EPTN(base, value) (USBHS_RMW_ENDPTNAK(base, (USBHS_ENDPTNAK_EPTN_MASK | USBHS_ENDPTNAK_EPRN_MASK), USBHS_ENDPTNAK_EPTN(value)))
#define USBHS_BWR_ENDPTNAK_EPTN(base, value) (USBHS_WR_ENDPTNAK_EPTN(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_ENDPTNAKEN - Endpoint NAK Enable Register
 ******************************************************************************/

/*!
 * @brief USBHS_ENDPTNAKEN - Endpoint NAK Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire USBHS_ENDPTNAKEN register
 */
/*@{*/
#define USBHS_RD_ENDPTNAKEN(base) (USBHS_ENDPTNAKEN_REG(base))
#define USBHS_WR_ENDPTNAKEN(base, value) (USBHS_ENDPTNAKEN_REG(base) = (value))
#define USBHS_RMW_ENDPTNAKEN(base, mask, value) (USBHS_WR_ENDPTNAKEN(base, (USBHS_RD_ENDPTNAKEN(base) & ~(mask)) | (value)))
#define USBHS_SET_ENDPTNAKEN(base, value) (USBHS_WR_ENDPTNAKEN(base, USBHS_RD_ENDPTNAKEN(base) |  (value)))
#define USBHS_CLR_ENDPTNAKEN(base, value) (USBHS_WR_ENDPTNAKEN(base, USBHS_RD_ENDPTNAKEN(base) & ~(value)))
#define USBHS_TOG_ENDPTNAKEN(base, value) (USBHS_WR_ENDPTNAKEN(base, USBHS_RD_ENDPTNAKEN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_ENDPTNAKEN bitfields
 */

/*!
 * @name Register USBHS_ENDPTNAKEN, field EPRNE[3:0] (W1C)
 *
 * Each bit is an enable bit for the corresponding RX Endpoint NAK bit. If this
 * bit is set and the corresponding RX Endpoint NAK bit is set, the NAK Interrupt
 * bit is set. EPRNE[3]-Endpoint #3 EPRNE[2]-Endpoint #2 EPRNE[1]-Endpoint #1
 * EPRNE[0]-Endpoint #0
 */
/*@{*/
/*! @brief Read current value of the USBHS_ENDPTNAKEN_EPRNE field. */
#define USBHS_RD_ENDPTNAKEN_EPRNE(base) ((USBHS_ENDPTNAKEN_REG(base) & USBHS_ENDPTNAKEN_EPRNE_MASK) >> USBHS_ENDPTNAKEN_EPRNE_SHIFT)
#define USBHS_BRD_ENDPTNAKEN_EPRNE(base) (USBHS_RD_ENDPTNAKEN_EPRNE(base))

/*! @brief Set the EPRNE field to a new value. */
#define USBHS_WR_ENDPTNAKEN_EPRNE(base, value) (USBHS_RMW_ENDPTNAKEN(base, (USBHS_ENDPTNAKEN_EPRNE_MASK | USBHS_ENDPTNAKEN_EPTNE_MASK), USBHS_ENDPTNAKEN_EPRNE(value)))
#define USBHS_BWR_ENDPTNAKEN_EPRNE(base, value) (USBHS_WR_ENDPTNAKEN_EPRNE(base, value))
/*@}*/

/*!
 * @name Register USBHS_ENDPTNAKEN, field EPTNE[19:16] (W1C)
 *
 * Each bit is an enable bit for the corresponding TX Endpoint NAK bit. If this
 * bit is set and the corresponding TX Endpoint NAK bit is set, the NAK Interrupt
 * bit is set. EPTNE[3]-Endpoint #3 EPTNE[2]-Endpoint #2 EPTNE[1]-Endpoint #1
 * EPTNE[0]-Endpoint #0
 */
/*@{*/
/*! @brief Read current value of the USBHS_ENDPTNAKEN_EPTNE field. */
#define USBHS_RD_ENDPTNAKEN_EPTNE(base) ((USBHS_ENDPTNAKEN_REG(base) & USBHS_ENDPTNAKEN_EPTNE_MASK) >> USBHS_ENDPTNAKEN_EPTNE_SHIFT)
#define USBHS_BRD_ENDPTNAKEN_EPTNE(base) (USBHS_RD_ENDPTNAKEN_EPTNE(base))

/*! @brief Set the EPTNE field to a new value. */
#define USBHS_WR_ENDPTNAKEN_EPTNE(base, value) (USBHS_RMW_ENDPTNAKEN(base, (USBHS_ENDPTNAKEN_EPTNE_MASK | USBHS_ENDPTNAKEN_EPRNE_MASK), USBHS_ENDPTNAKEN_EPTNE(value)))
#define USBHS_BWR_ENDPTNAKEN_EPTNE(base, value) (USBHS_WR_ENDPTNAKEN_EPTNE(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_CONFIGFLAG - Configure Flag Register
 ******************************************************************************/

/*!
 * @brief USBHS_CONFIGFLAG - Configure Flag Register (RO)
 *
 * Reset value: 0x00000001U
 *
 * This EHCI register is not used in this implementation. A read from this
 * register returns a constant of a 0x0000_0001 to indicate that all port routings
 * default to this host controller.
 */
/*!
 * @name Constants and macros for entire USBHS_CONFIGFLAG register
 */
/*@{*/
#define USBHS_RD_CONFIGFLAG(base) (USBHS_CONFIGFLAG_REG(base))
/*@}*/

