RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * USBHS_PORTSC1 - Port Status and Control Registers
 ******************************************************************************/

/*!
 * @brief USBHS_PORTSC1 - Port Status and Control Registers (RW)
 *
 * Reset value: 0x00000000U
 *
 * The USB module contains a single PORTSC register. This register only resets
 * when power is initially applied or in response to a controller reset. Initial
 * conditions of a port are: No device connected Port disabled If the port has
 * port power control, this state remains until software applies power to the port
 * by setting port power to one. For the USBHS module in device mode, the USBHS
 * controller does not support power control. Port control in device mode is used
 * only for status port reset, suspend, and current connect status. It is also
 * used to initiate test mode or force signaling, and allows software to place the
 * PHY into low-power suspend mode and disable the PHY clock.
 */
/*!
 * @name Constants and macros for entire USBHS_PORTSC1 register
 */
/*@{*/
#define USBHS_RD_PORTSC1(base)   (USBHS_PORTSC1_REG(base))
#define USBHS_WR_PORTSC1(base, value) (USBHS_PORTSC1_REG(base) = (value))
#define USBHS_RMW_PORTSC1(base, mask, value) (USBHS_WR_PORTSC1(base, (USBHS_RD_PORTSC1(base) & ~(mask)) | (value)))
#define USBHS_SET_PORTSC1(base, value) (USBHS_WR_PORTSC1(base, USBHS_RD_PORTSC1(base) |  (value)))
#define USBHS_CLR_PORTSC1(base, value) (USBHS_WR_PORTSC1(base, USBHS_RD_PORTSC1(base) & ~(value)))
#define USBHS_TOG_PORTSC1(base, value) (USBHS_WR_PORTSC1(base, USBHS_RD_PORTSC1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_PORTSC1 bitfields
 */

/*!
 * @name Register USBHS_PORTSC1, field CCS[0] (RO)
 *
 * Indicates that a device successfully attaches and operates in high speed or
 * full speed as indicated by the PSPD bit. If clear, the device did not attach
 * successfully or forcibly disconnects by the software clearing the USBCMD[RUN]
 * bit. It does not state the device disconnected or suspended. This bit is cleared
 * if the PP bit is cleared in host mode.
 *
 * Values:
 * - 0b0 - No device present (host mode) or attached (device mode)
 * - 0b1 - Device is present (host mode) or attached (device mode)
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_CCS field. */
#define USBHS_RD_PORTSC1_CCS(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_CCS_MASK) >> USBHS_PORTSC1_CCS_SHIFT)
#define USBHS_BRD_PORTSC1_CCS(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_CCS_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field CSC[1] (W1C)
 *
 * Host mode: This bit indicates a change occurred in the port's current connect
 * status. The controller sets this bit for all changes to the port device
 * connect status, even if system software has not cleared an existing connect status
 * change. For example, the insertion status changes twice before system software
 * has cleared the changed condition; hub hardware is setting an already-set bit
 * (i.e., the bit remains set). Software clears this bit by writing a 1 to it.
 * This field is cleared if the PP bit is cleared. Device mode: In device mode,
 * this bit is undefined.
 *
 * Values:
 * - 0b0 - No change
 * - 0b1 - Connect status has changed
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_CSC field. */
#define USBHS_RD_PORTSC1_CSC(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_CSC_MASK) >> USBHS_PORTSC1_CSC_SHIFT)
#define USBHS_BRD_PORTSC1_CSC(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_CSC_SHIFT))

/*! @brief Set the CSC field to a new value. */
#define USBHS_WR_PORTSC1_CSC(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_CSC(value)))
#define USBHS_BWR_PORTSC1_CSC(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_CSC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PE[2] (RW)
 *
 * Host mode: Ports can only be enabled by the controller as a part of the reset
 * and enable sequence. Software cannot enable a port by setting this bit. A
 * fault condition (disconnect event or other fault condition) or host software can
 * disable ports. The bit status does not change until the port state actually
 * changes. There may be a delay in disabling or enabling a port due to other host
 * and bus events. When the port is disabled, downstream propagation of data is
 * blocked except for reset. This field is cleared if the PP bit is cleared in
 * host mode. Device mode: The device port is always enabled. (This bit is set).
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PE field. */
#define USBHS_RD_PORTSC1_PE(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PE_MASK) >> USBHS_PORTSC1_PE_SHIFT)
#define USBHS_BRD_PORTSC1_PE(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PE_SHIFT))

/*! @brief Set the PE field to a new value. */
#define USBHS_WR_PORTSC1_PE(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PE_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PE(value)))
#define USBHS_BWR_PORTSC1_PE(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PEC[3] (W1C)
 *
 * For the root hub, this bit gets set only when a port is disabled due to
 * disconnect on the port or due to the appropriate conditions existing at the EOF2
 * point (See Chapter 11 of the USB Specification). Software clears this by writing
 * a 1 to it. In device mode, the device port is always enabled. (This bit is
 * zero). This bit is cleared if the PP bit is cleared.
 *
 * Values:
 * - 0b0 - No change
 * - 0b1 - Port disabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PEC field. */
#define USBHS_RD_PORTSC1_PEC(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PEC_MASK) >> USBHS_PORTSC1_PEC_SHIFT)
#define USBHS_BRD_PORTSC1_PEC(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PEC_SHIFT))

/*! @brief Set the PEC field to a new value. */
#define USBHS_WR_PORTSC1_PEC(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PEC(value)))
#define USBHS_BWR_PORTSC1_PEC(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PEC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field OCA[4] (RO)
 *
 * This bit automatically transitions from 1 to 0 when the over-current
 * condition is removed. For host/OTG implementations, the user can provide over-current
 * detection to the USBn_PWRFAULT signal for this condition. For device-only
 * implementations, this bit must always be cleared.
 *
 * Values:
 * - 0b0 - Port not in over-current condition
 * - 0b1 - Port currently in over-current condition
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_OCA field. */
#define USBHS_RD_PORTSC1_OCA(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_OCA_MASK) >> USBHS_PORTSC1_OCA_SHIFT)
#define USBHS_BRD_PORTSC1_OCA(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_OCA_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field OCC[5] (W1C)
 *
 * Indicates a change to the OCA bit. Software clears this bit by writing a 1.
 * For host mode, the user can provide over-current detection to the USBn_PWRFAULT
 * signal for this condition. For device-only implementations, this bit must
 * always be cleared.
 *
 * Values:
 * - 0b0 - No over-current
 * - 0b1 - Over-current detect
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_OCC field. */
#define USBHS_RD_PORTSC1_OCC(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_OCC_MASK) >> USBHS_PORTSC1_OCC_SHIFT)
#define USBHS_BRD_PORTSC1_OCC(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_OCC_SHIFT))

/*! @brief Set the OCC field to a new value. */
#define USBHS_WR_PORTSC1_OCC(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_OCC_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK), USBHS_PORTSC1_OCC(value)))
#define USBHS_BWR_PORTSC1_OCC(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_OCC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field FPR[6] (RW)
 *
 * This bit is not-EHCI compatible. Host mode: Software sets this bit to drive
 * resume signaling. The controller sets this bit if a J-to-K transition is
 * detected while the port is in suspend state (PE = SUSP = 1), which in turn sets the
 * USBSTS[PCI] bit. This bit automatically clears after the resume sequence is
 * complete. This behavior is different from EHCI where the host controller driver
 * is required to clear this bit after the resume duration is timed in the
 * driver. When the controller owns the port, the resume sequence follows the defined
 * sequence documented in the USB Specification Revision 2.0. The resume signaling
 * (full-speed K) is driven on the port as long as this bit remains set. This
 * bit remains set until the port switches to the high-speed idle. Clearing this
 * bit has no affect because the port controller times the resume operation to
 * clear the bit the port control state switches to HS or FS idle. This bit is
 * cleared if the PP bit is cleared in host mode. Device mode: If remote wakeup is
 * enabled, after the device is in suspend for 5 ms or more, software can set this
 * bit to drive resume signaling before clearing. The device controller sets this
 * bit if a J-to-K transition is detected while port is in suspend state, which in
 * turn sets the USBSTS[PCI] bit. The bit is cleared when the device returns to
 * normal operation.
 *
 * Values:
 * - 0b0 - No resume (K-state) detected/driven on port
 * - 0b1 - Resume detected/driven on port
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_FPR field. */
#define USBHS_RD_PORTSC1_FPR(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_FPR_MASK) >> USBHS_PORTSC1_FPR_SHIFT)
#define USBHS_BRD_PORTSC1_FPR(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_FPR_SHIFT))

/*! @brief Set the FPR field to a new value. */
#define USBHS_WR_PORTSC1_FPR(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_FPR_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_FPR(value)))
#define USBHS_BWR_PORTSC1_FPR(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_FPR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field SUSP[7] (RW)
 *
 * Host mode: The PE and SUSP bits define the port state as follows: PE SUSP
 * Port State 0 x Disable 1 0 Enable 1 1 Suspend When in suspend state, downstream
 * propagation of data is blocked on this port, except for port reset. The
 * blocking occurs at the end of the current transaction if a transaction was in
 * progress when this bit was set. In the suspend state, the port is sensitive to resume
 * detection. The bit status does not change until the port is suspended and
 * there may be a delay in suspending a port if there is a transaction currently in
 * progress on the USB. The module unconditionally clears this bit when software
 * clears the FPR bit. The host controller ignores clearing this bit. If host
 * software sets this bit when the port is not enabled (PE = 0), the results are
 * undefined. This bit is cleared if the PP bit is cleared in host mode. Device
 * mode: In device mode, this bit is a read-only status bit.
 *
 * Values:
 * - 0b0 - Port not in suspend state
 * - 0b1 - Port in suspend state
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_SUSP field. */
#define USBHS_RD_PORTSC1_SUSP(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_SUSP_MASK) >> USBHS_PORTSC1_SUSP_SHIFT)
#define USBHS_BRD_PORTSC1_SUSP(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_SUSP_SHIFT))

/*! @brief Set the SUSP field to a new value. */
#define USBHS_WR_PORTSC1_SUSP(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_SUSP_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_SUSP(value)))
#define USBHS_BWR_PORTSC1_SUSP(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_SUSP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PR[8] (RW)
 *
 * This field is cleared if the PP bit is cleared. Host mode: When software sets
 * this bit the bus-reset sequence as defined in the USB Specification Revision
 * 2.0 starts. This bit automatically clears after the reset sequence completes.
 * This behavior is different from EHCI where the host controller driver is
 * required to clear this bit after the reset duration is timed in the driver. Device
 * mode: This bit is a read-only status bit. Device reset from the USB bus is
 * also indicated in the USBSTS register.
 *
 * Values:
 * - 0b0 - Port is not in reset
 * - 0b1 - Port is in reset
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PR field. */
#define USBHS_RD_PORTSC1_PR(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PR_MASK) >> USBHS_PORTSC1_PR_SHIFT)
#define USBHS_BRD_PORTSC1_PR(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PR_SHIFT))

/*! @brief Set the PR field to a new value. */
#define USBHS_WR_PORTSC1_PR(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PR_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PR(value)))
#define USBHS_BWR_PORTSC1_PR(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field HSP[9] (RO)
 *
 * Indicates if the host/device connected is in high speed mode. This bit is
 * redundant with the PSPD bit field.
 *
 * Values:
 * - 0b0 - FS or LS
 * - 0b1 - HS
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_HSP field. */
#define USBHS_RD_PORTSC1_HSP(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_HSP_MASK) >> USBHS_PORTSC1_HSP_SHIFT)
#define USBHS_BRD_PORTSC1_HSP(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_HSP_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field LS[11:10] (RO)
 *
 * Reflects current logical levels of the USB DP (bit 11) and DM (bit 10) signal
 * lines. In host mode, the line status by the host controller driver is not
 * necessary (unlike EHCI) because hardware manages the connection of FS and LS. In
 * device mode, LS by the device controller is not necessary.
 *
 * Values:
 * - 0b00 - SE0
 * - 0b01 - J-state
 * - 0b10 - K-state
 * - 0b11 - Undefined
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_LS field. */
#define USBHS_RD_PORTSC1_LS(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_LS_MASK) >> USBHS_PORTSC1_LS_SHIFT)
#define USBHS_BRD_PORTSC1_LS(base) (USBHS_RD_PORTSC1_LS(base))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PP[12] (RW)
 *
 * Represents the current setting of the port power control switch (0 equals
 * off, 1 equals on). When power is not available on a port (PP = 0), it is
 * non-functional and does not report attaches, detaches, etc. When an over-current
 * condition is detected on a powered port, the host controller driver from a 1to a 0
 * (removing power from the port) transitions the PP bit in each affected port.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PP field. */
#define USBHS_RD_PORTSC1_PP(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PP_MASK) >> USBHS_PORTSC1_PP_SHIFT)
#define USBHS_BRD_PORTSC1_PP(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PP_SHIFT))

/*! @brief Set the PP field to a new value. */
#define USBHS_WR_PORTSC1_PP(base, value) (USBHS_RMW_PORTSC1(base, (USBHS_PORTSC1_PP_MASK | USBHS_PORTSC1_CSC_MASK | USBHS_PORTSC1_PEC_MASK | USBHS_PORTSC1_OCC_MASK), USBHS_PORTSC1_PP(value)))
#define USBHS_BWR_PORTSC1_PP(base, value) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_PORTSC1, field PO[13] (RW)
 *
 * Port owner handoff is not implemented in this device.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PORTSC1_PO field. */
#define USBHS_RD_PORTSC1_PO(base) ((USBHS_PORTSC1_REG(base) & USBHS_PORTSC1_PO_MASK) >> USBHS_PORTSC1_PO_SHIFT)
#define USBHS_BRD_PORTSC1_PO(base) (BITBAND_ACCESS32(&USBHS_PORTSC1_REG(base), USBHS_PORTSC1_PO_SHIFT))

