RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the BSEIS field to a new value. */
#define USBHS_WR_OTGSC_BSEIS(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_BSEIS(value)))
#define USBHS_BWR_OTGSC_BSEIS(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSEIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field MSS[21] (W1C)
 *
 * This bit is set once every millisecond. Software must write a 1 to clear this
 * bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_MSS field. */
#define USBHS_RD_OTGSC_MSS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_MSS_MASK) >> USBHS_OTGSC_MSS_SHIFT)
#define USBHS_BRD_OTGSC_MSS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_MSS_SHIFT))

/*! @brief Set the MSS field to a new value. */
#define USBHS_WR_OTGSC_MSS(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_MSS(value)))
#define USBHS_BWR_OTGSC_MSS(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_MSS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field DPIS[22] (W1C)
 *
 * Indicates when data bus pulsing occurs on DP or DM. Data bus pulsing only
 * detected when USBMODE[CM] equals 11 and PORTSC0[PP] is cleared. Software must
 * write a 1 to clear this bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_DPIS field. */
#define USBHS_RD_OTGSC_DPIS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_DPIS_MASK) >> USBHS_OTGSC_DPIS_SHIFT)
#define USBHS_BRD_OTGSC_DPIS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_DPIS_SHIFT))

/*! @brief Set the DPIS field to a new value. */
#define USBHS_WR_OTGSC_DPIS(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_DPIS_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK), USBHS_OTGSC_DPIS(value)))
#define USBHS_BWR_OTGSC_DPIS(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_DPIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field IDIE[24] (RW)
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_IDIE field. */
#define USBHS_RD_OTGSC_IDIE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_IDIE_MASK) >> USBHS_OTGSC_IDIE_SHIFT)
#define USBHS_BRD_OTGSC_IDIE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_IDIE_SHIFT))

/*! @brief Set the IDIE field to a new value. */
#define USBHS_WR_OTGSC_IDIE(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_IDIE_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_IDIE(value)))
#define USBHS_BWR_OTGSC_IDIE(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_IDIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field AVVIE[25] (RW)
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_AVVIE field. */
#define USBHS_RD_OTGSC_AVVIE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_AVVIE_MASK) >> USBHS_OTGSC_AVVIE_SHIFT)
#define USBHS_BRD_OTGSC_AVVIE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_AVVIE_SHIFT))

/*! @brief Set the AVVIE field to a new value. */
#define USBHS_WR_OTGSC_AVVIE(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_AVVIE_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_AVVIE(value)))
#define USBHS_BWR_OTGSC_AVVIE(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_AVVIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field ASVIE[26] (RW)
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_ASVIE field. */
#define USBHS_RD_OTGSC_ASVIE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_ASVIE_MASK) >> USBHS_OTGSC_ASVIE_SHIFT)
#define USBHS_BRD_OTGSC_ASVIE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_ASVIE_SHIFT))

/*! @brief Set the ASVIE field to a new value. */
#define USBHS_WR_OTGSC_ASVIE(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_ASVIE_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_ASVIE(value)))
#define USBHS_BWR_OTGSC_ASVIE(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_ASVIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field BSVIE[27] (RW)
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_BSVIE field. */
#define USBHS_RD_OTGSC_BSVIE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_BSVIE_MASK) >> USBHS_OTGSC_BSVIE_SHIFT)
#define USBHS_BRD_OTGSC_BSVIE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSVIE_SHIFT))

/*! @brief Set the BSVIE field to a new value. */
#define USBHS_WR_OTGSC_BSVIE(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_BSVIE_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_BSVIE(value)))
#define USBHS_BWR_OTGSC_BSVIE(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSVIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field BSEIE[28] (RW)
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_BSEIE field. */
#define USBHS_RD_OTGSC_BSEIE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_BSEIE_MASK) >> USBHS_OTGSC_BSEIE_SHIFT)
#define USBHS_BRD_OTGSC_BSEIE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSEIE_SHIFT))

/*! @brief Set the BSEIE field to a new value. */
#define USBHS_WR_OTGSC_BSEIE(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_BSEIE_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_BSEIE(value)))
#define USBHS_BWR_OTGSC_BSEIE(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSEIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field MSE[29] (RW)
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_MSE field. */
#define USBHS_RD_OTGSC_MSE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_MSE_MASK) >> USBHS_OTGSC_MSE_SHIFT)
#define USBHS_BRD_OTGSC_MSE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_MSE_SHIFT))

/*! @brief Set the MSE field to a new value. */
#define USBHS_WR_OTGSC_MSE(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_MSE_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_MSE(value)))
#define USBHS_BWR_OTGSC_MSE(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_MSE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field DPIE[30] (RW)
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_DPIE field. */
#define USBHS_RD_OTGSC_DPIE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_DPIE_MASK) >> USBHS_OTGSC_DPIE_SHIFT)
#define USBHS_BRD_OTGSC_DPIE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_DPIE_SHIFT))

