RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*
 * Constants & macros for individual USBHSDCD_CONTROL bitfields
 */

/*!
 * @name Register USBHSDCD_CONTROL, field IACK[0] (WORZ)
 *
 * Determines whether the interrupt is cleared.
 *
 * Values:
 * - 0b0 - Do not clear the interrupt.
 * - 0b1 - Clear the IF bit (interrupt flag).
 */
/*@{*/
/*! @brief Set the IACK field to a new value. */
#define USBHSDCD_WR_CONTROL_IACK(base, value) (USBHSDCD_RMW_CONTROL(base, USBHSDCD_CONTROL_IACK_MASK, USBHSDCD_CONTROL_IACK(value)))
#define USBHSDCD_BWR_CONTROL_IACK(base, value) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_IACK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHSDCD_CONTROL, field IF[8] (RO)
 *
 * Determines whether an interrupt is pending.
 *
 * Values:
 * - 0b0 - No interrupt is pending.
 * - 0b1 - An interrupt is pending.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_CONTROL_IF field. */
#define USBHSDCD_RD_CONTROL_IF(base) ((USBHSDCD_CONTROL_REG(base) & USBHSDCD_CONTROL_IF_MASK) >> USBHSDCD_CONTROL_IF_SHIFT)
#define USBHSDCD_BRD_CONTROL_IF(base) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_IF_SHIFT))
/*@}*/

/*!
 * @name Register USBHSDCD_CONTROL, field IE[16] (RW)
 *
 * Enables/disables interrupts to the system.
 *
 * Values:
 * - 0b0 - Disable interrupts to the system.
 * - 0b1 - Enable interrupts to the system.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_CONTROL_IE field. */
#define USBHSDCD_RD_CONTROL_IE(base) ((USBHSDCD_CONTROL_REG(base) & USBHSDCD_CONTROL_IE_MASK) >> USBHSDCD_CONTROL_IE_SHIFT)
#define USBHSDCD_BRD_CONTROL_IE(base) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_IE_SHIFT))

/*! @brief Set the IE field to a new value. */
#define USBHSDCD_WR_CONTROL_IE(base, value) (USBHSDCD_RMW_CONTROL(base, USBHSDCD_CONTROL_IE_MASK, USBHSDCD_CONTROL_IE(value)))
#define USBHSDCD_BWR_CONTROL_IE(base, value) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHSDCD_CONTROL, field BC12[17] (RW)
 *
 * BC1.2 compatibility. This bit cannot be changed after start detection.
 *
 * Values:
 * - 0b0 - Compatible with BC1.1 (default)
 * - 0b1 - Compatible with BC1.2
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_CONTROL_BC12 field. */
#define USBHSDCD_RD_CONTROL_BC12(base) ((USBHSDCD_CONTROL_REG(base) & USBHSDCD_CONTROL_BC12_MASK) >> USBHSDCD_CONTROL_BC12_SHIFT)
#define USBHSDCD_BRD_CONTROL_BC12(base) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_BC12_SHIFT))

/*! @brief Set the BC12 field to a new value. */
#define USBHSDCD_WR_CONTROL_BC12(base, value) (USBHSDCD_RMW_CONTROL(base, USBHSDCD_CONTROL_BC12_MASK, USBHSDCD_CONTROL_BC12(value)))
#define USBHSDCD_BWR_CONTROL_BC12(base, value) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_BC12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHSDCD_CONTROL, field START[24] (WORZ)
 *
 * Determines whether the charger detection sequence is initiated.
 *
 * Values:
 * - 0b0 - Do not start the sequence. Writes of this value have no effect.
 * - 0b1 - Initiate the charger detection sequence. If the sequence is already
 *     running, writes of this value have no effect.
 */
/*@{*/
/*! @brief Set the START field to a new value. */
#define USBHSDCD_WR_CONTROL_START(base, value) (USBHSDCD_RMW_CONTROL(base, USBHSDCD_CONTROL_START_MASK, USBHSDCD_CONTROL_START(value)))
#define USBHSDCD_BWR_CONTROL_START(base, value) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_START_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHSDCD_CONTROL, field SR[25] (WORZ)
 *
 * Determines whether a software reset is performed.
 *
 * Values:
 * - 0b0 - Do not perform a software reset.
 * - 0b1 - Perform a software reset.
 */
/*@{*/
/*! @brief Set the SR field to a new value. */
#define USBHSDCD_WR_CONTROL_SR(base, value) (USBHSDCD_RMW_CONTROL(base, USBHSDCD_CONTROL_SR_MASK, USBHSDCD_CONTROL_SR(value)))
#define USBHSDCD_BWR_CONTROL_SR(base, value) (BITBAND_ACCESS32(&USBHSDCD_CONTROL_REG(base), USBHSDCD_CONTROL_SR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHSDCD_CLOCK - Clock register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_CLOCK - Clock register (RW)
 *
 * Reset value: 0x000000C1U
 */
/*!
 * @name Constants and macros for entire USBHSDCD_CLOCK register
 */
/*@{*/
#define USBHSDCD_RD_CLOCK(base)  (USBHSDCD_CLOCK_REG(base))
#define USBHSDCD_WR_CLOCK(base, value) (USBHSDCD_CLOCK_REG(base) = (value))
#define USBHSDCD_RMW_CLOCK(base, mask, value) (USBHSDCD_WR_CLOCK(base, (USBHSDCD_RD_CLOCK(base) & ~(mask)) | (value)))
#define USBHSDCD_SET_CLOCK(base, value) (USBHSDCD_WR_CLOCK(base, USBHSDCD_RD_CLOCK(base) |  (value)))
#define USBHSDCD_CLR_CLOCK(base, value) (USBHSDCD_WR_CLOCK(base, USBHSDCD_RD_CLOCK(base) & ~(value)))
#define USBHSDCD_TOG_CLOCK(base, value) (USBHSDCD_WR_CLOCK(base, USBHSDCD_RD_CLOCK(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHSDCD_CLOCK bitfields
 */

/*!
 * @name Register USBHSDCD_CLOCK, field CLOCK_UNIT[0] (RW)
 *
 * Specifies the unit of measure for the clock speed.
 *
 * Values:
 * - 0b0 - kHz Speed (between 1 kHz and 1023 kHz)
 * - 0b1 - MHz Speed (between 1 MHz and 1023 MHz)
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_CLOCK_CLOCK_UNIT field. */
#define USBHSDCD_RD_CLOCK_CLOCK_UNIT(base) ((USBHSDCD_CLOCK_REG(base) & USBHSDCD_CLOCK_CLOCK_UNIT_MASK) >> USBHSDCD_CLOCK_CLOCK_UNIT_SHIFT)
#define USBHSDCD_BRD_CLOCK_CLOCK_UNIT(base) (BITBAND_ACCESS32(&USBHSDCD_CLOCK_REG(base), USBHSDCD_CLOCK_CLOCK_UNIT_SHIFT))

/*! @brief Set the CLOCK_UNIT field to a new value. */
#define USBHSDCD_WR_CLOCK_CLOCK_UNIT(base, value) (USBHSDCD_RMW_CLOCK(base, USBHSDCD_CLOCK_CLOCK_UNIT_MASK, USBHSDCD_CLOCK_CLOCK_UNIT(value)))
#define USBHSDCD_BWR_CLOCK_CLOCK_UNIT(base, value) (BITBAND_ACCESS32(&USBHSDCD_CLOCK_REG(base), USBHSDCD_CLOCK_CLOCK_UNIT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHSDCD_CLOCK, field CLOCK_SPEED[11:2] (RW)
 *
 * The unit of measure is programmed in CLOCK_UNIT. The valid range is from 1 to
 * 1023 when clock unit is MHz and 4 to 1023 when clock unit is kHz. Examples
 * with CLOCK_UNIT = 1: For 48 MHz: 0b00_0011_0000 (48) (Default) For 24 MHz:
 * 0b00_0001_1000 (24) Examples with CLOCK_UNIT = 0: For 100 kHz: 0b00_0110_0100 (100)
 * For 500 kHz: 0b01_1111_0100 (500)
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_CLOCK_CLOCK_SPEED field. */
#define USBHSDCD_RD_CLOCK_CLOCK_SPEED(base) ((USBHSDCD_CLOCK_REG(base) & USBHSDCD_CLOCK_CLOCK_SPEED_MASK) >> USBHSDCD_CLOCK_CLOCK_SPEED_SHIFT)
#define USBHSDCD_BRD_CLOCK_CLOCK_SPEED(base) (USBHSDCD_RD_CLOCK_CLOCK_SPEED(base))

