RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*******************************************************************************
 * USBHSDCD_TIMER0 - TIMER0 register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_TIMER0 - TIMER0 register (RW)
 *
 * Reset value: 0x00100000U
 *
 * TIMER0 has an TSEQ_INIT field that represents the system latency in ms.
 * Latency is measured from the time when VBUS goes active until the time system
 * software initiates charger detection sequence in USBDCD module. When software sets
 * the CONTROL[START] bit, the Unit Connection Timer (TUNITCON) is initialized
 * with the value of TSEQ_INIT. Valid values are 0-1023, however the USB Battery
 * Charging Specification requires the entire sequence, including TSEQ_INIT, to be
 * completed in 1s or less.
 */
/*!
 * @name Constants and macros for entire USBHSDCD_TIMER0 register
 */
/*@{*/
#define USBHSDCD_RD_TIMER0(base) (USBHSDCD_TIMER0_REG(base))
#define USBHSDCD_WR_TIMER0(base, value) (USBHSDCD_TIMER0_REG(base) = (value))
#define USBHSDCD_RMW_TIMER0(base, mask, value) (USBHSDCD_WR_TIMER0(base, (USBHSDCD_RD_TIMER0(base) & ~(mask)) | (value)))
#define USBHSDCD_SET_TIMER0(base, value) (USBHSDCD_WR_TIMER0(base, USBHSDCD_RD_TIMER0(base) |  (value)))
#define USBHSDCD_CLR_TIMER0(base, value) (USBHSDCD_WR_TIMER0(base, USBHSDCD_RD_TIMER0(base) & ~(value)))
#define USBHSDCD_TOG_TIMER0(base, value) (USBHSDCD_WR_TIMER0(base, USBHSDCD_RD_TIMER0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHSDCD_TIMER0 bitfields
 */

/*!
 * @name Register USBHSDCD_TIMER0, field TUNITCON[11:0] (RO)
 *
 * Displays the amount of elapsed time since the event of setting the START bit
 * plus the value of TSEQ_INIT. The timer is automatically initialized with the
 * value of TSEQ_INIT before starting to count. This timer enables compliance with
 * the maximum time allowed to connect T UNIT_CON under the USB Battery Charging
 * Specification. If the timer reaches the one second limit, the module triggers
 * an interrupt and sets the error flag STATUS[ERR]. The timer continues
 * counting throughout the charger detection sequence, even when control has been passed
 * to software. As long as the module is active, the timer continues to count
 * until it reaches the maximum value of 0xFFF (4095 ms). The timer does not
 * rollover to zero. A software reset clears the timer.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER0_TUNITCON field. */
#define USBHSDCD_RD_TIMER0_TUNITCON(base) ((USBHSDCD_TIMER0_REG(base) & USBHSDCD_TIMER0_TUNITCON_MASK) >> USBHSDCD_TIMER0_TUNITCON_SHIFT)
#define USBHSDCD_BRD_TIMER0_TUNITCON(base) (USBHSDCD_RD_TIMER0_TUNITCON(base))
/*@}*/

/*!
 * @name Register USBHSDCD_TIMER0, field TSEQ_INIT[25:16] (RW)
 *
 * TSEQ_INIT represents the system latency (in ms) measured from the time VBUS
 * goes active to the time system software initiates the charger detection
 * sequence in the USBDCD module. When software sets the CONTROL[START] bit, the Unit
 * Connection Timer (TUNITCON) is initialized with the value of TSEQ_INIT. Valid
 * values are 0-1023, but the USB Battery Charging Specification requires the
 * entire sequence, including TSEQ_INIT, to be completed in 1s or less.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER0_TSEQ_INIT field. */
#define USBHSDCD_RD_TIMER0_TSEQ_INIT(base) ((USBHSDCD_TIMER0_REG(base) & USBHSDCD_TIMER0_TSEQ_INIT_MASK) >> USBHSDCD_TIMER0_TSEQ_INIT_SHIFT)
#define USBHSDCD_BRD_TIMER0_TSEQ_INIT(base) (USBHSDCD_RD_TIMER0_TSEQ_INIT(base))

/*! @brief Set the TSEQ_INIT field to a new value. */
#define USBHSDCD_WR_TIMER0_TSEQ_INIT(base, value) (USBHSDCD_RMW_TIMER0(base, USBHSDCD_TIMER0_TSEQ_INIT_MASK, USBHSDCD_TIMER0_TSEQ_INIT(value)))
#define USBHSDCD_BWR_TIMER0_TSEQ_INIT(base, value) (USBHSDCD_WR_TIMER0_TSEQ_INIT(base, value))
/*@}*/

/*******************************************************************************
 * USBHSDCD_TIMER1 - TIMER1 register
 ******************************************************************************/

/*!
 * @brief USBHSDCD_TIMER1 - TIMER1 register (RW)
 *
 * Reset value: 0x000A0028U
 *
 * TIMER1 contains timing parameters. Note that register values can be written
 * that are not compliant with the USB Battery Charging Specification, so care
 * should be taken when overwriting the default values.
 */
/*!
 * @name Constants and macros for entire USBHSDCD_TIMER1 register
 */
/*@{*/
#define USBHSDCD_RD_TIMER1(base) (USBHSDCD_TIMER1_REG(base))
#define USBHSDCD_WR_TIMER1(base, value) (USBHSDCD_TIMER1_REG(base) = (value))
#define USBHSDCD_RMW_TIMER1(base, mask, value) (USBHSDCD_WR_TIMER1(base, (USBHSDCD_RD_TIMER1(base) & ~(mask)) | (value)))
#define USBHSDCD_SET_TIMER1(base, value) (USBHSDCD_WR_TIMER1(base, USBHSDCD_RD_TIMER1(base) |  (value)))
#define USBHSDCD_CLR_TIMER1(base, value) (USBHSDCD_WR_TIMER1(base, USBHSDCD_RD_TIMER1(base) & ~(value)))
#define USBHSDCD_TOG_TIMER1(base, value) (USBHSDCD_WR_TIMER1(base, USBHSDCD_RD_TIMER1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHSDCD_TIMER1 bitfields
 */

/*!
 * @name Register USBHSDCD_TIMER1, field TVDPSRC_ON[9:0] (RW)
 *
 * This timing parameter is used after detection of the data pin. See "Charging
 * Port Detection". Valid values are 1-1023, but the USB Battery Charging
 * Specification requires a minimum value of 40 ms.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER1_TVDPSRC_ON field. */
#define USBHSDCD_RD_TIMER1_TVDPSRC_ON(base) ((USBHSDCD_TIMER1_REG(base) & USBHSDCD_TIMER1_TVDPSRC_ON_MASK) >> USBHSDCD_TIMER1_TVDPSRC_ON_SHIFT)
#define USBHSDCD_BRD_TIMER1_TVDPSRC_ON(base) (USBHSDCD_RD_TIMER1_TVDPSRC_ON(base))

/*! @brief Set the TVDPSRC_ON field to a new value. */
#define USBHSDCD_WR_TIMER1_TVDPSRC_ON(base, value) (USBHSDCD_RMW_TIMER1(base, USBHSDCD_TIMER1_TVDPSRC_ON_MASK, USBHSDCD_TIMER1_TVDPSRC_ON(value)))
#define USBHSDCD_BWR_TIMER1_TVDPSRC_ON(base, value) (USBHSDCD_WR_TIMER1_TVDPSRC_ON(base, value))
/*@}*/

/*!
 * @name Register USBHSDCD_TIMER1, field TDCD_DBNC[25:16] (RW)
 *
 * Sets the time period (ms) to debounce the D+ signal during the data pin
 * contact detection phase. See "Debouncing the data pin contact" Valid values are
 * 1-1023, but the USB Battery Charging Specification requires a minimum value of 10
 * ms.
 */
/*@{*/
/*! @brief Read current value of the USBHSDCD_TIMER1_TDCD_DBNC field. */
#define USBHSDCD_RD_TIMER1_TDCD_DBNC(base) ((USBHSDCD_TIMER1_REG(base) & USBHSDCD_TIMER1_TDCD_DBNC_MASK) >> USBHSDCD_TIMER1_TDCD_DBNC_SHIFT)
#define USBHSDCD_BRD_TIMER1_TDCD_DBNC(base) (USBHSDCD_RD_TIMER1_TDCD_DBNC(base))

/*! @brief Set the TDCD_DBNC field to a new value. */
#define USBHSDCD_WR_TIMER1_TDCD_DBNC(base, value) (USBHSDCD_RMW_TIMER1(base, USBHSDCD_TIMER1_TDCD_DBNC_MASK, USBHSDCD_TIMER1_TDCD_DBNC(value)))
#define USBHSDCD_BWR_TIMER1_TDCD_DBNC(base, value) (USBHSDCD_WR_TIMER1_TDCD_DBNC(base, value))
/*@}*/

