RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*
 * MK26F18 USBPHY
 *
 * USBPHY Register Reference Index
 *
 * Registers defined in this header file:
 * - USBPHY_PWD - USB PHY Power-Down Register
 * - USBPHY_TX - USB PHY Transmitter Control Register
 * - USBPHY_RX - USB PHY Receiver Control Register
 * - USBPHY_CTRL - USB PHY General Control Register
 * - USBPHY_STATUS - USB PHY Status Register
 * - USBPHY_DEBUG - USB PHY Debug Register
 * - USBPHY_DEBUG0_STATUS - UTMI Debug Status Register 0
 * - USBPHY_DEBUG1 - UTMI Debug Status Register 1
 * - USBPHY_VERSION - UTMI RTL Version
 * - USBPHY_PLL_SIC - USB PHY PLL Control/Status Register
 * - USBPHY_USB1_VBUS_DETECT - USB PHY VBUS Detect Control Register
 * - USBPHY_USB1_VBUS_DET_STAT - USB PHY VBUS Detector Status Register
 * - USBPHY_USB1_CHRG_DET_STAT - USB PHY Charger Detect Status Register
 * - USBPHY_ANACTRL - USB PHY Analog Control Register
 * - USBPHY_USB1_LOOPBACK - USB PHY Loopback Control/Status Register
 * - USBPHY_USB1_LOOPBACK_HSFSCNT - USB PHY Loopback Packet Number Select Register
 * - USBPHY_TRIM_OVERRIDE_EN - USB PHY Trim Override Enable Register
 */

#define USBPHY_INSTANCE_COUNT (1U) /*!< Number of instances of the USBPHY module. */
#define USBPHY_IDX (0U) /*!< Instance number for USBPHY. */

/*******************************************************************************
 * USBPHY_PWD - USB PHY Power-Down Register
 ******************************************************************************/

/*!
 * @brief USBPHY_PWD - USB PHY Power-Down Register (RW)
 *
 * Reset value: 0x001E1C00U
 *
 * The USB PHY Power-Down Register provides overall control of the PHY power
 * state. Before programming this register, the PHY clocks must be enabled in the
 * USBPHY_CTRL and USBPHY_PLL_SIC registers.
 */
/*!
 * @name Constants and macros for entire USBPHY_PWD register
 */
/*@{*/
#define USBPHY_RD_PWD(base)      (USBPHY_PWD_REG(base))
#define USBPHY_WR_PWD(base, value) (USBPHY_PWD_REG(base) = (value))
#define USBPHY_RMW_PWD(base, mask, value) (USBPHY_WR_PWD(base, (USBPHY_RD_PWD(base) & ~(mask)) | (value)))
#define USBPHY_SET_PWD(base, value) (USBPHY_PWD_SET_REG(base) = (value))
#define USBPHY_CLR_PWD(base, value) (USBPHY_PWD_CLR_REG(base) = (value))
#define USBPHY_TOG_PWD(base, value) (USBPHY_PWD_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_PWD bitfields
 */

/*!
 * @name Register USBPHY_PWD, field TXPWDFS[10] (RW)
 *
 * Note that this bit will be auto cleared if there is USB wakeup event while
 * ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled.
 *
 * Values:
 * - 0b0 - Normal operation.
 * - 0b1 - Power-down the USB full-speed drivers. This turns off the current
 *     starvation sources and puts the drivers into high-impedance output
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PWD_TXPWDFS field. */
#define USBPHY_RD_PWD_TXPWDFS(base) ((USBPHY_PWD_REG(base) & USBPHY_PWD_TXPWDFS_MASK) >> USBPHY_PWD_TXPWDFS_SHIFT)
#define USBPHY_BRD_PWD_TXPWDFS(base) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_TXPWDFS_SHIFT))

/*! @brief Set the TXPWDFS field to a new value. */
#define USBPHY_WR_PWD_TXPWDFS(base, value) (USBPHY_RMW_PWD(base, USBPHY_PWD_TXPWDFS_MASK, USBPHY_PWD_TXPWDFS(value)))
#define USBPHY_BWR_PWD_TXPWDFS(base, value) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_TXPWDFS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PWD, field TXPWDIBIAS[11] (RW)
 *
 * Note that this bit will be auto cleared if there is USB wakeup event while
 * ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled. Note that these circuits are
 * shared with the battery charge circuit. Setting this bit to 1 does not
 * power-down these circuits, unless the corresponding bit in the battery charger is also
 * set for power-down.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Power-down the USB PHY current bias block for the transmitter. This
 *     bit should be set only when the USB is in suspend mode. This effectively
 *     powers down the entire USB transmit path
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PWD_TXPWDIBIAS field. */
#define USBPHY_RD_PWD_TXPWDIBIAS(base) ((USBPHY_PWD_REG(base) & USBPHY_PWD_TXPWDIBIAS_MASK) >> USBPHY_PWD_TXPWDIBIAS_SHIFT)
#define USBPHY_BRD_PWD_TXPWDIBIAS(base) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_TXPWDIBIAS_SHIFT))

/*! @brief Set the TXPWDIBIAS field to a new value. */
#define USBPHY_WR_PWD_TXPWDIBIAS(base, value) (USBPHY_RMW_PWD(base, USBPHY_PWD_TXPWDIBIAS_MASK, USBPHY_PWD_TXPWDIBIAS(value)))
#define USBPHY_BWR_PWD_TXPWDIBIAS(base, value) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_TXPWDIBIAS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PWD, field TXPWDV2I[12] (RW)
 *
 * Note that this bit will be auto cleared if there is USB wakeup event while
 * ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled. Note that these circuits are
 * shared with the battery charge circuit. Setting this to 1 does not power-down
 * these circuits, unless the corresponding bit in the battery charger is also set
 * for power-down.
 *
 * Values:
 * - 0b0 - Normal operation.
 * - 0b1 - Power-down the USB PHY transmit V-to-I converter and the current
 *     mirror
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PWD_TXPWDV2I field. */
#define USBPHY_RD_PWD_TXPWDV2I(base) ((USBPHY_PWD_REG(base) & USBPHY_PWD_TXPWDV2I_MASK) >> USBPHY_PWD_TXPWDV2I_SHIFT)
#define USBPHY_BRD_PWD_TXPWDV2I(base) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_TXPWDV2I_SHIFT))

/*! @brief Set the TXPWDV2I field to a new value. */
#define USBPHY_WR_PWD_TXPWDV2I(base, value) (USBPHY_RMW_PWD(base, USBPHY_PWD_TXPWDV2I_MASK, USBPHY_PWD_TXPWDV2I(value)))
#define USBPHY_BWR_PWD_TXPWDV2I(base, value) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_TXPWDV2I_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PWD, field RXPWDENV[17] (RW)
 *
 * Note that this bit will be auto cleared if there is USB wakeup event while
 * ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled.
 *
 * Values:
 * - 0b0 - Normal operation.
 * - 0b1 - Power-down the USB high-speed receiver envelope detector (squelch
 *     signal)
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PWD_RXPWDENV field. */
#define USBPHY_RD_PWD_RXPWDENV(base) ((USBPHY_PWD_REG(base) & USBPHY_PWD_RXPWDENV_MASK) >> USBPHY_PWD_RXPWDENV_SHIFT)
#define USBPHY_BRD_PWD_RXPWDENV(base) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWDENV_SHIFT))

/*! @brief Set the RXPWDENV field to a new value. */
#define USBPHY_WR_PWD_RXPWDENV(base, value) (USBPHY_RMW_PWD(base, USBPHY_PWD_RXPWDENV_MASK, USBPHY_PWD_RXPWDENV(value)))
#define USBPHY_BWR_PWD_RXPWDENV(base, value) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWDENV_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PWD, field RXPWD1PT1[18] (RW)
 *
 * Note that this bit will be auto cleared if there is USB wakeup event while
 * ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Power-down the USB full-speed differential receiver.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PWD_RXPWD1PT1 field. */
#define USBPHY_RD_PWD_RXPWD1PT1(base) ((USBPHY_PWD_REG(base) & USBPHY_PWD_RXPWD1PT1_MASK) >> USBPHY_PWD_RXPWD1PT1_SHIFT)
#define USBPHY_BRD_PWD_RXPWD1PT1(base) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWD1PT1_SHIFT))

/*! @brief Set the RXPWD1PT1 field to a new value. */
#define USBPHY_WR_PWD_RXPWD1PT1(base, value) (USBPHY_RMW_PWD(base, USBPHY_PWD_RXPWD1PT1_MASK, USBPHY_PWD_RXPWD1PT1(value)))
#define USBPHY_BWR_PWD_RXPWD1PT1(base, value) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWD1PT1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_PWD, field RXPWDDIFF[19] (RW)
 *
 * Note that this bit will be auto cleared if there is USB wakeup event while
 * ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled.
 *
 * Values:
 * - 0b0 - Normal operation.
 * - 0b1 - Power-down the USB high-speed differential receiver
 */
/*@{*/
/*! @brief Read current value of the USBPHY_PWD_RXPWDDIFF field. */
#define USBPHY_RD_PWD_RXPWDDIFF(base) ((USBPHY_PWD_REG(base) & USBPHY_PWD_RXPWDDIFF_MASK) >> USBPHY_PWD_RXPWDDIFF_SHIFT)
#define USBPHY_BRD_PWD_RXPWDDIFF(base) (BITBAND_ACCESS32(&USBPHY_PWD_REG(base), USBPHY_PWD_RXPWDDIFF_SHIFT))

