RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the DEBUG_INTERFACE_HOLD field to a new value. */
#define USBPHY_WR_DEBUG_DEBUG_INTERFACE_HOLD(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_DEBUG_INTERFACE_HOLD_MASK, USBPHY_DEBUG_DEBUG_INTERFACE_HOLD(value)))
#define USBPHY_BWR_DEBUG_DEBUG_INTERFACE_HOLD(base, value) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_DEBUG_INTERFACE_HOLD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field HSTPULLDOWN[3:2] (RW)
 *
 * This bit field selects whether to connect pulldown resistors on the
 * USB_DP/USB_DM pins if the corresponding pulldown overdrive mode is enabled through
 * USBPHY_DEBUG[5:4} Set bit 3 to value 1'b1 to connect the 15ohm pulldown on USB_DP
 * line. Set bit 2 to value 1'b1 to connect the 15ohm pulldown on the USB_DM
 * line. Clear both bits to value 2'b00 to disconnect the pulldowns in override mode.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_HSTPULLDOWN field. */
#define USBPHY_RD_DEBUG_HSTPULLDOWN(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_HSTPULLDOWN_MASK) >> USBPHY_DEBUG_HSTPULLDOWN_SHIFT)
#define USBPHY_BRD_DEBUG_HSTPULLDOWN(base) (USBPHY_RD_DEBUG_HSTPULLDOWN(base))

/*! @brief Set the HSTPULLDOWN field to a new value. */
#define USBPHY_WR_DEBUG_HSTPULLDOWN(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_HSTPULLDOWN_MASK, USBPHY_DEBUG_HSTPULLDOWN(value)))
#define USBPHY_BWR_DEBUG_HSTPULLDOWN(base, value) (USBPHY_WR_DEBUG_HSTPULLDOWN(base, value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field ENHSTPULLDOWN[5:4] (RW)
 *
 * This bit field selects host pulldown overdrive mode. Set bit 5 to value 1'b1
 * to override the control of the USB_DP 15kohm pulldown. Set bit 4 to value 1'b1
 * to override the control of the USB_DM 15ohm pulldown. Clear both bits to
 * value 2'b00 to disable the host pulldown overdrive mode. When in host pulldown
 * overdrive mode, the connection of the individual pulldown resistors is further
 * controlled by the USBPHY_DEBUG[3:2] bit field.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_ENHSTPULLDOWN field. */
#define USBPHY_RD_DEBUG_ENHSTPULLDOWN(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_ENHSTPULLDOWN_MASK) >> USBPHY_DEBUG_ENHSTPULLDOWN_SHIFT)
#define USBPHY_BRD_DEBUG_ENHSTPULLDOWN(base) (USBPHY_RD_DEBUG_ENHSTPULLDOWN(base))

/*! @brief Set the ENHSTPULLDOWN field to a new value. */
#define USBPHY_WR_DEBUG_ENHSTPULLDOWN(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_ENHSTPULLDOWN_MASK, USBPHY_DEBUG_ENHSTPULLDOWN(value)))
#define USBPHY_BWR_DEBUG_ENHSTPULLDOWN(base, value) (USBPHY_WR_DEBUG_ENHSTPULLDOWN(base, value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field TX2RXCOUNT[11:8] (RW)
 *
 * Delay in between the end of transmit to the beginning of receive. This is a
 * Johnson count value and thus will count to 8.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_TX2RXCOUNT field. */
#define USBPHY_RD_DEBUG_TX2RXCOUNT(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_TX2RXCOUNT_MASK) >> USBPHY_DEBUG_TX2RXCOUNT_SHIFT)
#define USBPHY_BRD_DEBUG_TX2RXCOUNT(base) (USBPHY_RD_DEBUG_TX2RXCOUNT(base))

/*! @brief Set the TX2RXCOUNT field to a new value. */
#define USBPHY_WR_DEBUG_TX2RXCOUNT(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_TX2RXCOUNT_MASK, USBPHY_DEBUG_TX2RXCOUNT(value)))
#define USBPHY_BWR_DEBUG_TX2RXCOUNT(base, value) (USBPHY_WR_DEBUG_TX2RXCOUNT(base, value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field ENTX2RXCOUNT[12] (RW)
 *
 * Set this bit to allow a countdown to transition in between TX and RX.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_ENTX2RXCOUNT field. */
#define USBPHY_RD_DEBUG_ENTX2RXCOUNT(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_ENTX2RXCOUNT_MASK) >> USBPHY_DEBUG_ENTX2RXCOUNT_SHIFT)
#define USBPHY_BRD_DEBUG_ENTX2RXCOUNT(base) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_ENTX2RXCOUNT_SHIFT))

/*! @brief Set the ENTX2RXCOUNT field to a new value. */
#define USBPHY_WR_DEBUG_ENTX2RXCOUNT(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_ENTX2RXCOUNT_MASK, USBPHY_DEBUG_ENTX2RXCOUNT(value)))
#define USBPHY_BWR_DEBUG_ENTX2RXCOUNT(base, value) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_ENTX2RXCOUNT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field SQUELCHRESETCOUNT[20:16] (RW)
 *
 * Delay in between the detection of squelch to the reset of high-speed RX.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_SQUELCHRESETCOUNT field. */
#define USBPHY_RD_DEBUG_SQUELCHRESETCOUNT(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_SQUELCHRESETCOUNT_MASK) >> USBPHY_DEBUG_SQUELCHRESETCOUNT_SHIFT)
#define USBPHY_BRD_DEBUG_SQUELCHRESETCOUNT(base) (USBPHY_RD_DEBUG_SQUELCHRESETCOUNT(base))

/*! @brief Set the SQUELCHRESETCOUNT field to a new value. */
#define USBPHY_WR_DEBUG_SQUELCHRESETCOUNT(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_SQUELCHRESETCOUNT_MASK, USBPHY_DEBUG_SQUELCHRESETCOUNT(value)))
#define USBPHY_BWR_DEBUG_SQUELCHRESETCOUNT(base, value) (USBPHY_WR_DEBUG_SQUELCHRESETCOUNT(base, value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field ENSQUELCHRESET[24] (RW)
 *
 * Set bit to allow squelch to reset high-speed receive.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_ENSQUELCHRESET field. */
#define USBPHY_RD_DEBUG_ENSQUELCHRESET(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_ENSQUELCHRESET_MASK) >> USBPHY_DEBUG_ENSQUELCHRESET_SHIFT)
#define USBPHY_BRD_DEBUG_ENSQUELCHRESET(base) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_ENSQUELCHRESET_SHIFT))

/*! @brief Set the ENSQUELCHRESET field to a new value. */
#define USBPHY_WR_DEBUG_ENSQUELCHRESET(base, value) (USBPHY_RMW_DEBUG(base, USBPHY_DEBUG_ENSQUELCHRESET_MASK, USBPHY_DEBUG_ENSQUELCHRESET(value)))
#define USBPHY_BWR_DEBUG_ENSQUELCHRESET(base, value) (BITBAND_ACCESS32(&USBPHY_DEBUG_REG(base), USBPHY_DEBUG_ENSQUELCHRESET_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_DEBUG, field SQUELCHRESETLENGTH[28:25] (RW)
 *
 * Duration of RESET in terms of the number of 480-MHz cycles.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_DEBUG_SQUELCHRESETLENGTH field. */
#define USBPHY_RD_DEBUG_SQUELCHRESETLENGTH(base) ((USBPHY_DEBUG_REG(base) & USBPHY_DEBUG_SQUELCHRESETLENGTH_MASK) >> USBPHY_DEBUG_SQUELCHRESETLENGTH_SHIFT)
#define USBPHY_BRD_DEBUG_SQUELCHRESETLENGTH(base) (USBPHY_RD_DEBUG_SQUELCHRESETLENGTH(base))

