RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*
 * Constants & macros for individual USBPHY_USB1_CHRG_DET_STAT bitfields
 */

/*!
 * @name Register USBPHY_USB1_CHRG_DET_STAT, field PLUG_CONTACT[0] (RO)
 *
 * During the Data Contact Detection phase per the USB Battery Charging
 * Specification Revision 1.2 using the USBHSDCD module, this bit field indicates whether
 * a USB cable has been attached between the remote host and the local device.
 *
 * Values:
 * - 0b0 - No USB cable attachment has been detected
 * - 0b1 - A USB cable attachment between the device and host has been detected
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT field. */
#define USBPHY_RD_USB1_CHRG_DET_STAT_PLUG_CONTACT(base) ((USBPHY_USB1_CHRG_DET_STAT_REG(base) & USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_MASK) >> USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_SHIFT)
#define USBPHY_BRD_USB1_CHRG_DET_STAT_PLUG_CONTACT(base) (BITBAND_ACCESS32(&USBPHY_USB1_CHRG_DET_STAT_REG(base), USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_CHRG_DET_STAT, field CHRG_DETECTED[1] (RO)
 *
 * During the USB Battery Charging Primary Detection phase using the USBHSDCD
 * module, this bit field indicates whether a Standard Downstream Port or Charging
 * Port was detected.
 *
 * Values:
 * - 0b0 - Standard Downstream Port (SDP) has been detected
 * - 0b1 - Charging Port has been detected
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED field. */
#define USBPHY_RD_USB1_CHRG_DET_STAT_CHRG_DETECTED(base) ((USBPHY_USB1_CHRG_DET_STAT_REG(base) & USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_MASK) >> USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_SHIFT)
#define USBPHY_BRD_USB1_CHRG_DET_STAT_CHRG_DETECTED(base) (BITBAND_ACCESS32(&USBPHY_USB1_CHRG_DET_STAT_REG(base), USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_CHRG_DET_STAT, field DM_STATE[2] (RO)
 *
 * Single ended receiver output for the USB_DM pin, from charger detection
 * circuits.
 *
 * Values:
 * - 0b0 - USB_DM pin voltage is < 0.8V
 * - 0b1 - USB_DM pin voltage is > 2.0V
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_CHRG_DET_STAT_DM_STATE field. */
#define USBPHY_RD_USB1_CHRG_DET_STAT_DM_STATE(base) ((USBPHY_USB1_CHRG_DET_STAT_REG(base) & USBPHY_USB1_CHRG_DET_STAT_DM_STATE_MASK) >> USBPHY_USB1_CHRG_DET_STAT_DM_STATE_SHIFT)
#define USBPHY_BRD_USB1_CHRG_DET_STAT_DM_STATE(base) (BITBAND_ACCESS32(&USBPHY_USB1_CHRG_DET_STAT_REG(base), USBPHY_USB1_CHRG_DET_STAT_DM_STATE_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_CHRG_DET_STAT, field DP_STATE[3] (RO)
 *
 * Single ended receiver output for the USB_DP pin, from charger detection
 * circuits.
 *
 * Values:
 * - 0b0 - USB_DP pin voltage is < 0.8V
 * - 0b1 - USB_DP pin voltage is > 2.0V
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_CHRG_DET_STAT_DP_STATE field. */
#define USBPHY_RD_USB1_CHRG_DET_STAT_DP_STATE(base) ((USBPHY_USB1_CHRG_DET_STAT_REG(base) & USBPHY_USB1_CHRG_DET_STAT_DP_STATE_MASK) >> USBPHY_USB1_CHRG_DET_STAT_DP_STATE_SHIFT)
#define USBPHY_BRD_USB1_CHRG_DET_STAT_DP_STATE(base) (BITBAND_ACCESS32(&USBPHY_USB1_CHRG_DET_STAT_REG(base), USBPHY_USB1_CHRG_DET_STAT_DP_STATE_SHIFT))
/*@}*/

/*!
 * @name Register USBPHY_USB1_CHRG_DET_STAT, field SECDET_DCP[4] (RO)
 *
 * During the USB Battery Charging Secondary Detection phase using the USBHSDCD
 * module, this bit field indicates which kind of Charging Port was detected.
 *
 * Values:
 * - 0b0 - Charging Downstream Port (CDP) has been detected
 * - 0b1 - Downstream Charging Port (DCP) has been detected
 */
/*@{*/
/*! @brief Read current value of the USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP field. */
#define USBPHY_RD_USB1_CHRG_DET_STAT_SECDET_DCP(base) ((USBPHY_USB1_CHRG_DET_STAT_REG(base) & USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_MASK) >> USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_SHIFT)
#define USBPHY_BRD_USB1_CHRG_DET_STAT_SECDET_DCP(base) (BITBAND_ACCESS32(&USBPHY_USB1_CHRG_DET_STAT_REG(base), USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_SHIFT))
/*@}*/

/*******************************************************************************
 * USBPHY_ANACTRL - USB PHY Analog Control Register
 ******************************************************************************/

/*!
 * @brief USBPHY_ANACTRL - USB PHY Analog Control Register (RW)
 *
 * Reset value: 0x00000402U
 *
 * The USBPHY_ANACTRL register has bit fields for the Phase Fractional Divider
 * (PFD) clock output along with controls for adding pre-emphasis to the USB
 * High-Speed TX output drivers. The PFD input clock comes from the 480MHz USB PLL,
 * and the PFD output clock (pfd_clk) is used to generate the USB1PFDCLK for use
 * outside the USB HS PHY.
 */
/*!
 * @name Constants and macros for entire USBPHY_ANACTRL register
 */
/*@{*/
#define USBPHY_RD_ANACTRL(base)  (USBPHY_ANACTRL_REG(base))
#define USBPHY_WR_ANACTRL(base, value) (USBPHY_ANACTRL_REG(base) = (value))
#define USBPHY_RMW_ANACTRL(base, mask, value) (USBPHY_WR_ANACTRL(base, (USBPHY_RD_ANACTRL(base) & ~(mask)) | (value)))
#define USBPHY_SET_ANACTRL(base, value) (USBPHY_ANACTRL_SET_REG(base) = (value))
#define USBPHY_CLR_ANACTRL(base, value) (USBPHY_ANACTRL_CLR_REG(base) = (value))
#define USBPHY_TOG_ANACTRL(base, value) (USBPHY_ANACTRL_TOG_REG(base) = (value))
/*@}*/

/*
 * Constants & macros for individual USBPHY_ANACTRL bitfields
 */

/*!
 * @name Register USBPHY_ANACTRL, field TESTCLK_SEL[0] (RW)
 *
 * Test clock selection to analog test. Not for customer use. The value of this
 * bit field must remain at 1'b0 for normal operation.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_TESTCLK_SEL field. */
#define USBPHY_RD_ANACTRL_TESTCLK_SEL(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_TESTCLK_SEL_MASK) >> USBPHY_ANACTRL_TESTCLK_SEL_SHIFT)
#define USBPHY_BRD_ANACTRL_TESTCLK_SEL(base) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_TESTCLK_SEL_SHIFT))

/*! @brief Set the TESTCLK_SEL field to a new value. */
#define USBPHY_WR_ANACTRL_TESTCLK_SEL(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_TESTCLK_SEL_MASK, USBPHY_ANACTRL_TESTCLK_SEL(value)))
#define USBPHY_BWR_ANACTRL_TESTCLK_SEL(base, value) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_TESTCLK_SEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field PFD_CLKGATE[1] (RW)
 *
 * This bit field controls clock gating (disabling) for the PFD pfd_clk output
 * for power savings when the PFD is not used. Setting the bit to value 1'b1 will
 * gate the output of PFD. This gating will also be enabled if the PFD reference
 * clock is not stable, the USB PLL is not locked, or the USB PLL is not
 * enabled.This bit field must be reset to value 1'b0 to enable the pfd_clk output.
 *
 * Values:
 * - 0b0 - PFD clock output is enabled
 * - 0b1 - PFD clock output is gated (Default)
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_PFD_CLKGATE field. */
#define USBPHY_RD_ANACTRL_PFD_CLKGATE(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_PFD_CLKGATE_MASK) >> USBPHY_ANACTRL_PFD_CLKGATE_SHIFT)
#define USBPHY_BRD_ANACTRL_PFD_CLKGATE(base) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_PFD_CLKGATE_SHIFT))

/*! @brief Set the PFD_CLKGATE field to a new value. */
#define USBPHY_WR_ANACTRL_PFD_CLKGATE(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_PFD_CLKGATE_MASK, USBPHY_ANACTRL_PFD_CLKGATE(value)))
#define USBPHY_BWR_ANACTRL_PFD_CLKGATE(base, value) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_PFD_CLKGATE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field PFD_CLK_SEL[3:2] (RW)
 *
 * This bit field for the PFD selects the frequency relationship between the
 * local pfd_clk output and the exported USB1PFDCLK.
 *
 * Values:
 * - 0b00 - USB1PFDCLK is the same frequency as the xtal clock (Default)
 * - 0b01 - USB1PFDCLK frequency is pfd_clk divided by 4
 * - 0b10 - USB1PFDCLK frequency is pfd_clk divided by 2
 * - 0b11 - USB1PFDCLK frequency is the same as pfd_clk frequency
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_PFD_CLK_SEL field. */
#define USBPHY_RD_ANACTRL_PFD_CLK_SEL(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_PFD_CLK_SEL_MASK) >> USBPHY_ANACTRL_PFD_CLK_SEL_SHIFT)
#define USBPHY_BRD_ANACTRL_PFD_CLK_SEL(base) (USBPHY_RD_ANACTRL_PFD_CLK_SEL(base))

/*! @brief Set the PFD_CLK_SEL field to a new value. */
#define USBPHY_WR_ANACTRL_PFD_CLK_SEL(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_PFD_CLK_SEL_MASK, USBPHY_ANACTRL_PFD_CLK_SEL(value)))
#define USBPHY_BWR_ANACTRL_PFD_CLK_SEL(base, value) (USBPHY_WR_ANACTRL_PFD_CLK_SEL(base, value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field PFD_FRAC[9:4] (RW)
 *
 * PFD fractional divider setting used to select the pfd_clk output frequency.
 * Changing this bit field will cause pfd_update to be toggled. The pfd_clk output
 * frequency is 480MHz*18/N where N=18~35. Valid values of PFD_FRAC are from
 * 6'd18 to 6'd35, other values may cause undefined results.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_PFD_FRAC field. */
#define USBPHY_RD_ANACTRL_PFD_FRAC(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_PFD_FRAC_MASK) >> USBPHY_ANACTRL_PFD_FRAC_SHIFT)
#define USBPHY_BRD_ANACTRL_PFD_FRAC(base) (USBPHY_RD_ANACTRL_PFD_FRAC(base))

/*! @brief Set the PFD_FRAC field to a new value. */
#define USBPHY_WR_ANACTRL_PFD_FRAC(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_PFD_FRAC_MASK, USBPHY_ANACTRL_PFD_FRAC(value)))
#define USBPHY_BWR_ANACTRL_PFD_FRAC(base, value) (USBPHY_WR_ANACTRL_PFD_FRAC(base, value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field DEV_PULLDOWN[10] (RW)
 *
 * Setting this field to 1'b1 will enable the 15kohm pulldown resistors on both
 * USB_DP and USB_DM pins. This feature can be used in device mode while the USB
 * cable is disconnected to keep the data pins at known values, avoiding
 * unnecessary interrupts from the single ended receivers. This bit must be reset to 1'b0
 * during normal USB data communication in device mode, or while battery charger
 * detection using the USBHSDCD module is used.
 *
 * Values:
 * - 0b0 - The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare
 *     disabled in device mode.
 * - 0b1 - The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare enabled
 *     in device mode.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_DEV_PULLDOWN field. */
#define USBPHY_RD_ANACTRL_DEV_PULLDOWN(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_DEV_PULLDOWN_MASK) >> USBPHY_ANACTRL_DEV_PULLDOWN_SHIFT)
#define USBPHY_BRD_ANACTRL_DEV_PULLDOWN(base) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_DEV_PULLDOWN_SHIFT))

/*! @brief Set the DEV_PULLDOWN field to a new value. */
#define USBPHY_WR_ANACTRL_DEV_PULLDOWN(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_DEV_PULLDOWN_MASK, USBPHY_ANACTRL_DEV_PULLDOWN(value)))
#define USBPHY_BWR_ANACTRL_DEV_PULLDOWN(base, value) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_DEV_PULLDOWN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field EMPH_PULSE_CTRL[12:11] (RW)
 *
 * Controls pre-emphasis time duration for the High Speed TX drivers after each
 * data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1'b1.The
 * time duration for the pre-emphasis current increases as the value written to
 * this bit field increases.
 *
 * Values:
 * - 0b00 - Minimum duration of pre-emphasis current after each data transition
 * - 0b01 -
 * - 0b10 -
 * - 0b11 - Maximum duration of pre-emphasis current after each data transition
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_EMPH_PULSE_CTRL field. */
#define USBPHY_RD_ANACTRL_EMPH_PULSE_CTRL(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_EMPH_PULSE_CTRL_MASK) >> USBPHY_ANACTRL_EMPH_PULSE_CTRL_SHIFT)
#define USBPHY_BRD_ANACTRL_EMPH_PULSE_CTRL(base) (USBPHY_RD_ANACTRL_EMPH_PULSE_CTRL(base))

/*! @brief Set the EMPH_PULSE_CTRL field to a new value. */
#define USBPHY_WR_ANACTRL_EMPH_PULSE_CTRL(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_EMPH_PULSE_CTRL_MASK, USBPHY_ANACTRL_EMPH_PULSE_CTRL(value)))
#define USBPHY_BWR_ANACTRL_EMPH_PULSE_CTRL(base, value) (USBPHY_WR_ANACTRL_EMPH_PULSE_CTRL(base, value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field EMPH_EN[13] (RW)
 *
 * Enables pre-emphasis for the High-Speed TX drivers. Pre-emphasis adds
 * additional output drive current for a brief period after each data transition. Use of
 * pre-emphasis may be useful to optimize signal integrity depending on board
 * design choices.
 *
 * Values:
 * - 0b0 - No pre-emphasis is used on HS TX output drivers
 * - 0b1 - Enables pre-emphasis for HS TX output drivers
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_EMPH_EN field. */
#define USBPHY_RD_ANACTRL_EMPH_EN(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_EMPH_EN_MASK) >> USBPHY_ANACTRL_EMPH_EN_SHIFT)
#define USBPHY_BRD_ANACTRL_EMPH_EN(base) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_EMPH_EN_SHIFT))

/*! @brief Set the EMPH_EN field to a new value. */
#define USBPHY_WR_ANACTRL_EMPH_EN(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_EMPH_EN_MASK, USBPHY_ANACTRL_EMPH_EN(value)))
#define USBPHY_BWR_ANACTRL_EMPH_EN(base, value) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_EMPH_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field EMPH_CUR_CTRL[15:14] (RW)
 *
 * Controls the amount of pre-emphasis current added for the High-Speed TX
 * drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high
 * to 1'b1. Each unit of pre-emphasis current adds approximately 3% to the
 * nominal HS TX output current.
 *
 * Values:
 * - 0b00 - No pre-emphasis current is enabled for the HS TX drivers
 * - 0b01 - One unit of pre-emphasis current is enabled for the HS TX drivers
 * - 0b10 - Two units of pre-emphasis current are enabled for the HS TX drivers
 * - 0b11 - Three units of pre-emphasis current are enabled for the HS TX drivers
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_EMPH_CUR_CTRL field. */
#define USBPHY_RD_ANACTRL_EMPH_CUR_CTRL(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_EMPH_CUR_CTRL_MASK) >> USBPHY_ANACTRL_EMPH_CUR_CTRL_SHIFT)
#define USBPHY_BRD_ANACTRL_EMPH_CUR_CTRL(base) (USBPHY_RD_ANACTRL_EMPH_CUR_CTRL(base))

/*! @brief Set the EMPH_CUR_CTRL field to a new value. */
#define USBPHY_WR_ANACTRL_EMPH_CUR_CTRL(base, value) (USBPHY_RMW_ANACTRL(base, USBPHY_ANACTRL_EMPH_CUR_CTRL_MASK, USBPHY_ANACTRL_EMPH_CUR_CTRL(value)))
#define USBPHY_BWR_ANACTRL_EMPH_CUR_CTRL(base, value) (USBPHY_WR_ANACTRL_EMPH_CUR_CTRL(base, value))
/*@}*/

/*!
 * @name Register USBPHY_ANACTRL, field PFD_STABLE[31] (RO)
 *
 * PFD stable signal from the Phase Fractional Divider.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_ANACTRL_PFD_STABLE field. */
#define USBPHY_RD_ANACTRL_PFD_STABLE(base) ((USBPHY_ANACTRL_REG(base) & USBPHY_ANACTRL_PFD_STABLE_MASK) >> USBPHY_ANACTRL_PFD_STABLE_SHIFT)
#define USBPHY_BRD_ANACTRL_PFD_STABLE(base) (BITBAND_ACCESS32(&USBPHY_ANACTRL_REG(base), USBPHY_ANACTRL_PFD_STABLE_SHIFT))
/*@}*/

