RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18_extension.h
/*! @brief Set the TRIM_ENV_TAIL_ADJ_VD_OVERRIDE field to a new value. */
#define USBPHY_WR_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE(base, value) (USBPHY_RMW_TRIM_OVERRIDE_EN(base, USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK, USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE(value)))
#define USBPHY_BWR_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_TX_D_CAL_OVERRIDE[2] (RW)
 *
 * Override enable for TX_D_CAL, when set, the register value in USBPHY_TX[3:0]
 * will be used.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_SHIFT))

/*! @brief Set the TRIM_TX_D_CAL_OVERRIDE field to a new value. */
#define USBPHY_WR_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE(base, value) (USBPHY_RMW_TRIM_OVERRIDE_EN(base, USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_MASK, USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE(value)))
#define USBPHY_BWR_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_TX_CAL45DP_OVERRIDE[3] (RW)
 *
 * Override enable for TX_CAL45DP, when set, the register value in
 * USBPHY_TX[19:16] will be used.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE_SHIFT))

/*! @brief Set the TRIM_TX_CAL45DP_OVERRIDE field to a new value. */
#define USBPHY_WR_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE(base, value) (USBPHY_RMW_TRIM_OVERRIDE_EN(base, USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE_MASK, USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE(value)))
#define USBPHY_BWR_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_TX_CAL45DM_OVERRIDE[4] (RW)
 *
 * Override enable for TX_CAL45DM, when set, the register value in
 * USBPHY_TX[11:8] will be used.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE(base) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE_SHIFT))

/*! @brief Set the TRIM_TX_CAL45DM_OVERRIDE field to a new value. */
#define USBPHY_WR_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE(base, value) (USBPHY_RMW_TRIM_OVERRIDE_EN(base, USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE_MASK, USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE(value)))
#define USBPHY_BWR_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE(base, value) (BITBAND_ACCESS32(&USBPHY_TRIM_OVERRIDE_EN_REG(base), USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_PLL_CTRL0_DIV_SEL[17:16] (RO)
 *
 * IFR value of PLL_DIV_SEL.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL(base) (USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL(base))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_USB_REG_ENV_TAIL_ADJ_VD[19:18] (RO)
 *
 * IFR value of ENV_TAIL_ADJ.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD(base) (USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD(base))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_USBPHY_TX_D_CAL[23:20] (RO)
 *
 * IFR value of TX_D_CAL.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL(base) (USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL(base))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_USBPHY_TX_CAL45DP[27:24] (RO)
 *
 * IFR value of TX_CAL45DP.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP(base) (USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP(base))
/*@}*/

/*!
 * @name Register USBPHY_TRIM_OVERRIDE_EN, field TRIM_USBPHY_TX_CAL45DM[31:28] (RO)
 *
 * IFR value of TX_CAL45DM.
 */
/*@{*/
/*! @brief Read current value of the USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM field. */
#define USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM(base) ((USBPHY_TRIM_OVERRIDE_EN_REG(base) & USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM_MASK) >> USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM_SHIFT)
#define USBPHY_BRD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM(base) (USBPHY_RD_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM(base))
/*@}*/

